HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  F184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH3_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF010F184u)

/** Alias (User Manual Name) for GTM_ATOM4_CH3_SOMP.
* To use register names with standard convension, please use GTM_ATOM4_CH3_SOMP.
*/
#define	GTM_ATOM4_CH3_CTRL_SOMP	(GTM_ATOM4_CH3_SOMP)

/** \\brief  F184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH3_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF010F184u)

/** Alias (User Manual Name) for GTM_ATOM4_CH3_SOMS.
* To use register names with standard convension, please use GTM_ATOM4_CH3_SOMS.
*/
#define	GTM_ATOM4_CH3_CTRL_SOMS	(GTM_ATOM4_CH3_SOMS)

/** \\brief  F188, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH3_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F188u)

/** \\brief  F18C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH3_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F18Cu)

/** \\brief  F19C, ATOM Channel Status Register */
#define GTM_ATOM4_CH3_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F19Cu)

/** \\brief  F210, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH4_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F210u)

/** \\brief  F214, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH4_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F214u)

/** \\brief  F218, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH4_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F218u)

/** \\brief  F204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F204u)

/** \\brief  F224, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F224u)

/** \\brief  F228, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F228u)

/** \\brief  F22C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F22Cu)

/** \\brief  F220, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F220u)

/** \\brief  F200, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH4_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F200u)

/** \\brief  F204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH4_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF010F204u)

/** Alias (User Manual Name) for GTM_ATOM4_CH4_SOMC.
* To use register names with standard convension, please use GTM_ATOM4_CH4_SOMC.
*/
#define	GTM_ATOM4_CH4_CTRL_SOMC	(GTM_ATOM4_CH4_SOMC)

/** \\brief  F204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH4_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF010F204u)

/** Alias (User Manual Name) for GTM_ATOM4_CH4_SOMI.
* To use register names with standard convension, please use GTM_ATOM4_CH4_SOMI.
*/
#define	GTM_ATOM4_CH4_CTRL_SOMI	(GTM_ATOM4_CH4_SOMI)

/** \\brief  F204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH4_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF010F204u)

/** Alias (User Manual Name) for GTM_ATOM4_CH4_SOMP.
* To use register names with standard convension, please use GTM_ATOM4_CH4_SOMP.
*/
#define	GTM_ATOM4_CH4_CTRL_SOMP	(GTM_ATOM4_CH4_SOMP)

/** \\brief  F204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH4_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF010F204u)

/** Alias (User Manual Name) for GTM_ATOM4_CH4_SOMS.
* To use register names with standard convension, please use GTM_ATOM4_CH4_SOMS.
*/
#define	GTM_ATOM4_CH4_CTRL_SOMS	(GTM_ATOM4_CH4_SOMS)

/** \\brief  F208, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH4_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F208u)

/** \\brief  F20C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH4_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F20Cu)

/** \\brief  F21C, ATOM Channel Status Register */
#define GTM_ATOM4_CH4_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F21Cu)

/** \\brief  F290, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH5_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F290u)

/** \\brief  F294, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH5_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F294u)

/** \\brief  F298, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH5_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F298u)

/** \\brief  F284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F284u)

/** \\brief  F2A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F2A4u)

/** \\brief  F2A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F2A8u)

/** \\brief  F2AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F2ACu)

/** \\brief  F2A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F2A0u)

/** \\brief  F280, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH5_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F280u)

/** \\brief  F284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH5_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF010F284u)

/** Alias (User Manual Name) for GTM_ATOM4_CH5_SOMC.
* To use register names with standard convension, please use GTM_ATOM4_CH5_SOMC.
*/
#define	GTM_ATOM4_CH5_CTRL_SOMC	(GTM_ATOM4_CH5_SOMC)

/** \\brief  F284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH5_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF010F284u)

