HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM5_CH1_SOMS.
* To use register names with standard convension, please use GTM_ATOM5_CH1_SOMS.
*/
#define	GTM_ATOM5_CH1_CTRL_SOMS	(GTM_ATOM5_CH1_SOMS)

/** \\brief  F888, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH1_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F888u)

/** \\brief  F88C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH1_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F88Cu)

/** \\brief  F89C, ATOM Channel Status Register */
#define GTM_ATOM5_CH1_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F89Cu)

/** \\brief  F910, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM5_CH2_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F910u)

/** \\brief  F914, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM5_CH2_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F914u)

/** \\brief  F918, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM5_CH2_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F918u)

/** \\brief  F904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F904u)

/** \\brief  F924, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM5_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F924u)

/** \\brief  F928, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM5_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F928u)

/** \\brief  F92C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM5_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F92Cu)

/** \\brief  F920, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM5_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F920u)

/** \\brief  F900, ATOM Channel ARU Read Address Register */
#define GTM_ATOM5_CH2_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F900u)

/** \\brief  F904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH2_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF010F904u)

/** Alias (User Manual Name) for GTM_ATOM5_CH2_SOMC.
* To use register names with standard convension, please use GTM_ATOM5_CH2_SOMC.
*/
#define	GTM_ATOM5_CH2_CTRL_SOMC	(GTM_ATOM5_CH2_SOMC)

/** \\brief  F904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH2_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF010F904u)

/** Alias (User Manual Name) for GTM_ATOM5_CH2_SOMI.
* To use register names with standard convension, please use GTM_ATOM5_CH2_SOMI.
*/
#define	GTM_ATOM5_CH2_CTRL_SOMI	(GTM_ATOM5_CH2_SOMI)

/** \\brief  F904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH2_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF010F904u)

/** Alias (User Manual Name) for GTM_ATOM5_CH2_SOMP.
* To use register names with standard convension, please use GTM_ATOM5_CH2_SOMP.
*/
#define	GTM_ATOM5_CH2_CTRL_SOMP	(GTM_ATOM5_CH2_SOMP)

/** \\brief  F904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH2_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF010F904u)

/** Alias (User Manual Name) for GTM_ATOM5_CH2_SOMS.
* To use register names with standard convension, please use GTM_ATOM5_CH2_SOMS.
*/
#define	GTM_ATOM5_CH2_CTRL_SOMS	(GTM_ATOM5_CH2_SOMS)

/** \\brief  F908, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH2_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F908u)

/** \\brief  F90C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH2_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F90Cu)

/** \\brief  F91C, ATOM Channel Status Register */
#define GTM_ATOM5_CH2_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F91Cu)

/** \\brief  F990, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM5_CH3_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F990u)

/** \\brief  F994, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM5_CH3_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F994u)

/** \\brief  F998, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM5_CH3_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F998u)

/** \\brief  F984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F984u)

/** \\brief  F9A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM5_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F9A4u)

/** \\brief  F9A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM5_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F9A8u)

/** \\brief  F9AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM5_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F9ACu)

/** \\brief  F9A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM5_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F9A0u)

/** \\brief  F980, ATOM Channel ARU Read Address Register */
#define GTM_ATOM5_CH3_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F980u)

/** \\brief  F984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH3_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF010F984u)

/** Alias (User Manual Name) for GTM_ATOM5_CH3_SOMC.
* To use register names with standard convension, please use GTM_ATOM5_CH3_SOMC.
*/
#define	GTM_ATOM5_CH3_CTRL_SOMC	(GTM_ATOM5_CH3_SOMC)

/** \\brief  F984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH3_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF010F984u)

/** Alias (User Manual Name) for GTM_ATOM5_CH3_SOMI.
* To use register names with standard convension, please use GTM_ATOM5_CH3_SOMI.
*/
#define	GTM_ATOM5_CH3_CTRL_SOMI	(GTM_ATOM5_CH3_SOMI)

/** \\brief  F984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH3_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF010F984u)

/** Alias (User Manual Name) for GTM_ATOM5_CH3_SOMP.
* To use register names with standard convension, please use GTM_ATOM5_CH3_SOMP.
*/
#define	GTM_ATOM5_CH3_CTRL_SOMP	(GTM_ATOM5_CH3_SOMP)

/** \\brief  F984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH3_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF010F984u)

/** Alias (User Manual Name) for GTM_ATOM5_CH3_SOMS.
* To use register names with standard convension, please use GTM_ATOM5_CH3_SOMS.
*/
#define	GTM_ATOM5_CH3_CTRL_SOMS	(GTM_ATOM5_CH3_SOMS)

/** \\brief  F988, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH3_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F988u)

/** \\brief  F98C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH3_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F98Cu)

