HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  F99C, ATOM Channel Status Register */
#define GTM_ATOM5_CH3_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F99Cu)

/** \\brief  FA10, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM5_CH4_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010FA10u)

/** \\brief  FA14, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM5_CH4_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010FA14u)

/** \\brief  FA18, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM5_CH4_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010FA18u)

/** \\brief  FA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010FA04u)

/** \\brief  FA24, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM5_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010FA24u)

/** \\brief  FA28, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM5_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010FA28u)

/** \\brief  FA2C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM5_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010FA2Cu)

/** \\brief  FA20, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM5_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010FA20u)

/** \\brief  FA00, ATOM Channel ARU Read Address Register */
#define GTM_ATOM5_CH4_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010FA00u)

/** \\brief  FA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH4_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF010FA04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH4_SOMC.
* To use register names with standard convension, please use GTM_ATOM5_CH4_SOMC.
*/
#define	GTM_ATOM5_CH4_CTRL_SOMC	(GTM_ATOM5_CH4_SOMC)

/** \\brief  FA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH4_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF010FA04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH4_SOMI.
* To use register names with standard convension, please use GTM_ATOM5_CH4_SOMI.
*/
#define	GTM_ATOM5_CH4_CTRL_SOMI	(GTM_ATOM5_CH4_SOMI)

/** \\brief  FA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH4_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF010FA04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH4_SOMP.
* To use register names with standard convension, please use GTM_ATOM5_CH4_SOMP.
*/
#define	GTM_ATOM5_CH4_CTRL_SOMP	(GTM_ATOM5_CH4_SOMP)

/** \\brief  FA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH4_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF010FA04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH4_SOMS.
* To use register names with standard convension, please use GTM_ATOM5_CH4_SOMS.
*/
#define	GTM_ATOM5_CH4_CTRL_SOMS	(GTM_ATOM5_CH4_SOMS)

/** \\brief  FA08, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH4_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010FA08u)

/** \\brief  FA0C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH4_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010FA0Cu)

/** \\brief  FA1C, ATOM Channel Status Register */
#define GTM_ATOM5_CH4_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010FA1Cu)

/** \\brief  FA90, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM5_CH5_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010FA90u)

/** \\brief  FA94, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM5_CH5_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010FA94u)

/** \\brief  FA98, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM5_CH5_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010FA98u)

/** \\brief  FA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010FA84u)

/** \\brief  FAA4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM5_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010FAA4u)

/** \\brief  FAA8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM5_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010FAA8u)

/** \\brief  FAAC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM5_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010FAACu)

/** \\brief  FAA0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM5_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010FAA0u)

/** \\brief  FA80, ATOM Channel ARU Read Address Register */
#define GTM_ATOM5_CH5_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010FA80u)

/** \\brief  FA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH5_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF010FA84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH5_SOMC.
* To use register names with standard convension, please use GTM_ATOM5_CH5_SOMC.
*/
#define	GTM_ATOM5_CH5_CTRL_SOMC	(GTM_ATOM5_CH5_SOMC)

/** \\brief  FA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH5_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF010FA84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH5_SOMI.
* To use register names with standard convension, please use GTM_ATOM5_CH5_SOMI.
*/
#define	GTM_ATOM5_CH5_CTRL_SOMI	(GTM_ATOM5_CH5_SOMI)

/** \\brief  FA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH5_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF010FA84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH5_SOMP.
* To use register names with standard convension, please use GTM_ATOM5_CH5_SOMP.
*/
#define	GTM_ATOM5_CH5_CTRL_SOMP	(GTM_ATOM5_CH5_SOMP)

/** \\brief  FA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH5_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF010FA84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH5_SOMS.
* To use register names with standard convension, please use GTM_ATOM5_CH5_SOMS.
*/
#define	GTM_ATOM5_CH5_CTRL_SOMS	(GTM_ATOM5_CH5_SOMS)

/** \\brief  FA88, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH5_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010FA88u)

/** \\brief  FA8C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH5_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010FA8Cu)

/** \\brief  FA9C, ATOM Channel Status Register */
#define GTM_ATOM5_CH5_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010FA9Cu)

/** \\brief  FB10, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM5_CH6_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010FB10u)

/** \\brief  FB14, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM5_CH6_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010FB14u)

