HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  FB18, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM5_CH6_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010FB18u)

/** \\brief  FB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010FB04u)

/** \\brief  FB24, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM5_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010FB24u)

/** \\brief  FB28, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM5_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010FB28u)

/** \\brief  FB2C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM5_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010FB2Cu)

/** \\brief  FB20, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM5_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010FB20u)

/** \\brief  FB00, ATOM Channel ARU Read Address Register */
#define GTM_ATOM5_CH6_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010FB00u)

/** \\brief  FB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH6_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF010FB04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH6_SOMC.
* To use register names with standard convension, please use GTM_ATOM5_CH6_SOMC.
*/
#define	GTM_ATOM5_CH6_CTRL_SOMC	(GTM_ATOM5_CH6_SOMC)

/** \\brief  FB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH6_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF010FB04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH6_SOMI.
* To use register names with standard convension, please use GTM_ATOM5_CH6_SOMI.
*/
#define	GTM_ATOM5_CH6_CTRL_SOMI	(GTM_ATOM5_CH6_SOMI)

/** \\brief  FB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH6_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF010FB04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH6_SOMP.
* To use register names with standard convension, please use GTM_ATOM5_CH6_SOMP.
*/
#define	GTM_ATOM5_CH6_CTRL_SOMP	(GTM_ATOM5_CH6_SOMP)

/** \\brief  FB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH6_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF010FB04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH6_SOMS.
* To use register names with standard convension, please use GTM_ATOM5_CH6_SOMS.
*/
#define	GTM_ATOM5_CH6_CTRL_SOMS	(GTM_ATOM5_CH6_SOMS)

/** \\brief  FB08, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH6_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010FB08u)

/** \\brief  FB0C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH6_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010FB0Cu)

/** \\brief  FB1C, ATOM Channel Status Register */
#define GTM_ATOM5_CH6_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010FB1Cu)

/** \\brief  FB90, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM5_CH7_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010FB90u)

/** \\brief  FB94, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM5_CH7_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010FB94u)

/** \\brief  FB98, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM5_CH7_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010FB98u)

/** \\brief  FB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010FB84u)

/** \\brief  FBA4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM5_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010FBA4u)

/** \\brief  FBA8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM5_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010FBA8u)

/** \\brief  FBAC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM5_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010FBACu)

/** \\brief  FBA0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM5_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010FBA0u)

/** \\brief  FB80, ATOM Channel ARU Read Address Register */
#define GTM_ATOM5_CH7_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010FB80u)

/** \\brief  FB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH7_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF010FB84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH7_SOMC.
* To use register names with standard convension, please use GTM_ATOM5_CH7_SOMC.
*/
#define	GTM_ATOM5_CH7_CTRL_SOMC	(GTM_ATOM5_CH7_SOMC)

/** \\brief  FB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH7_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF010FB84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH7_SOMI.
* To use register names with standard convension, please use GTM_ATOM5_CH7_SOMI.
*/
#define	GTM_ATOM5_CH7_CTRL_SOMI	(GTM_ATOM5_CH7_SOMI)

/** \\brief  FB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH7_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF010FB84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH7_SOMP.
* To use register names with standard convension, please use GTM_ATOM5_CH7_SOMP.
*/
#define	GTM_ATOM5_CH7_CTRL_SOMP	(GTM_ATOM5_CH7_SOMP)

/** \\brief  FB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH7_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF010FB84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH7_SOMS.
* To use register names with standard convension, please use GTM_ATOM5_CH7_SOMS.
*/
#define	GTM_ATOM5_CH7_CTRL_SOMS	(GTM_ATOM5_CH7_SOMS)

/** \\brief  FB88, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH7_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010FB88u)

/** \\brief  FB8C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH7_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010FB8Cu)

/** \\brief  FB9C, ATOM Channel Status Register */
#define GTM_ATOM5_CH7_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010FB9Cu)

/** \\brief  1004C, TOM TGC0 Action Time Base Register */
#define GTM_ATOM6_AGC_ACT_TB /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB*)0xF011004Cu)

/** \\brief  10044, ATOM AGC Enable/Disable Control Register */
#define GTM_ATOM6_AGC_ENDIS_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL*)0xF0110044u)

/** \\brief  10048, ATOM AGC Enable/Disable Status Register */
#define GTM_ATOM6_AGC_ENDIS_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT*)0xF0110048u)

/** \\brief  10058, ATOM AGC Force Update Control Register */
#define GTM_ATOM6_AGC_FUPD_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL*)0xF0110058u)

/** \\brief  10040, ATOM AGC Global control register */
#define GTM_ATOM6_AGC_GLB_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL*)0xF0110040u)

