HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  1005C, ATOM AGC Internal Trigger Control Register */
#define GTM_ATOM6_AGC_INT_TRIG /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG*)0xF011005Cu)

/** \\brief  10050, ATOM AGC Output Enable Control Register */
#define GTM_ATOM6_AGC_OUTEN_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL*)0xF0110050u)

/** \\brief  10054, ATOM AGC Output Enable Status Register */
#define GTM_ATOM6_AGC_OUTEN_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT*)0xF0110054u)

/** \\brief  10010, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM6_CH0_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110010u)

/** \\brief  10014, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM6_CH0_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110014u)

/** \\brief  10018, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM6_CH0_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110018u)

/** \\brief  10004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH0_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110004u)

/** \\brief  10024, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM6_CH0_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0110024u)

/** \\brief  10028, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM6_CH0_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0110028u)

/** \\brief  1002C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM6_CH0_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF011002Cu)

/** \\brief  10020, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM6_CH0_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0110020u)

/** \\brief  10000, ATOM Channel ARU Read Address Register */
#define GTM_ATOM6_CH0_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110000u)

/** \\brief  10004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH0_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0110004u)

/** Alias (User Manual Name) for GTM_ATOM6_CH0_SOMC.
* To use register names with standard convension, please use GTM_ATOM6_CH0_SOMC.
*/
#define	GTM_ATOM6_CH0_CTRL_SOMC	(GTM_ATOM6_CH0_SOMC)

/** \\brief  10004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH0_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF0110004u)

/** Alias (User Manual Name) for GTM_ATOM6_CH0_SOMI.
* To use register names with standard convension, please use GTM_ATOM6_CH0_SOMI.
*/
#define	GTM_ATOM6_CH0_CTRL_SOMI	(GTM_ATOM6_CH0_SOMI)

/** \\brief  10004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH0_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF0110004u)

/** Alias (User Manual Name) for GTM_ATOM6_CH0_SOMP.
* To use register names with standard convension, please use GTM_ATOM6_CH0_SOMP.
*/
#define	GTM_ATOM6_CH0_CTRL_SOMP	(GTM_ATOM6_CH0_SOMP)

/** \\brief  10004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH0_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF0110004u)

/** Alias (User Manual Name) for GTM_ATOM6_CH0_SOMS.
* To use register names with standard convension, please use GTM_ATOM6_CH0_SOMS.
*/
#define	GTM_ATOM6_CH0_CTRL_SOMS	(GTM_ATOM6_CH0_SOMS)

/** \\brief  10008, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH0_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110008u)

/** \\brief  1000C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH0_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011000Cu)

/** \\brief  1001C, ATOM Channel Status Register */
#define GTM_ATOM6_CH0_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011001Cu)

/** \\brief  10090, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM6_CH1_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110090u)

/** \\brief  10094, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM6_CH1_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110094u)

/** \\brief  10098, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM6_CH1_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110098u)

/** \\brief  10084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110084u)

/** \\brief  100A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM6_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01100A4u)

/** \\brief  100A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM6_CH1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01100A8u)

/** \\brief  100AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM6_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01100ACu)

/** \\brief  100A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM6_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01100A0u)

/** \\brief  10080, ATOM Channel ARU Read Address Register */
#define GTM_ATOM6_CH1_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110080u)

/** \\brief  10084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH1_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0110084u)

/** Alias (User Manual Name) for GTM_ATOM6_CH1_SOMC.
* To use register names with standard convension, please use GTM_ATOM6_CH1_SOMC.
*/
#define	GTM_ATOM6_CH1_CTRL_SOMC	(GTM_ATOM6_CH1_SOMC)

/** \\brief  10084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH1_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF0110084u)

/** Alias (User Manual Name) for GTM_ATOM6_CH1_SOMI.
* To use register names with standard convension, please use GTM_ATOM6_CH1_SOMI.
*/
#define	GTM_ATOM6_CH1_CTRL_SOMI	(GTM_ATOM6_CH1_SOMI)

/** \\brief  10084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH1_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF0110084u)

/** Alias (User Manual Name) for GTM_ATOM6_CH1_SOMP.
* To use register names with standard convension, please use GTM_ATOM6_CH1_SOMP.
*/
#define	GTM_ATOM6_CH1_CTRL_SOMP	(GTM_ATOM6_CH1_SOMP)

