HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  10084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH1_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF0110084u)

/** Alias (User Manual Name) for GTM_ATOM6_CH1_SOMS.
* To use register names with standard convension, please use GTM_ATOM6_CH1_SOMS.
*/
#define	GTM_ATOM6_CH1_CTRL_SOMS	(GTM_ATOM6_CH1_SOMS)

/** \\brief  10088, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH1_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110088u)

/** \\brief  1008C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH1_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011008Cu)

/** \\brief  1009C, ATOM Channel Status Register */
#define GTM_ATOM6_CH1_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011009Cu)

/** \\brief  10110, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM6_CH2_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110110u)

/** \\brief  10114, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM6_CH2_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110114u)

/** \\brief  10118, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM6_CH2_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110118u)

/** \\brief  10104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110104u)

/** \\brief  10124, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM6_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0110124u)

/** \\brief  10128, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM6_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0110128u)

/** \\brief  1012C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM6_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF011012Cu)

/** \\brief  10120, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM6_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0110120u)

/** \\brief  10100, ATOM Channel ARU Read Address Register */
#define GTM_ATOM6_CH2_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110100u)

/** \\brief  10104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH2_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0110104u)

/** Alias (User Manual Name) for GTM_ATOM6_CH2_SOMC.
* To use register names with standard convension, please use GTM_ATOM6_CH2_SOMC.
*/
#define	GTM_ATOM6_CH2_CTRL_SOMC	(GTM_ATOM6_CH2_SOMC)

/** \\brief  10104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH2_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF0110104u)

/** Alias (User Manual Name) for GTM_ATOM6_CH2_SOMI.
* To use register names with standard convension, please use GTM_ATOM6_CH2_SOMI.
*/
#define	GTM_ATOM6_CH2_CTRL_SOMI	(GTM_ATOM6_CH2_SOMI)

/** \\brief  10104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH2_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF0110104u)

/** Alias (User Manual Name) for GTM_ATOM6_CH2_SOMP.
* To use register names with standard convension, please use GTM_ATOM6_CH2_SOMP.
*/
#define	GTM_ATOM6_CH2_CTRL_SOMP	(GTM_ATOM6_CH2_SOMP)

/** \\brief  10104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH2_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF0110104u)

/** Alias (User Manual Name) for GTM_ATOM6_CH2_SOMS.
* To use register names with standard convension, please use GTM_ATOM6_CH2_SOMS.
*/
#define	GTM_ATOM6_CH2_CTRL_SOMS	(GTM_ATOM6_CH2_SOMS)

/** \\brief  10108, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH2_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110108u)

/** \\brief  1010C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH2_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011010Cu)

/** \\brief  1011C, ATOM Channel Status Register */
#define GTM_ATOM6_CH2_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011011Cu)

/** \\brief  10190, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM6_CH3_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110190u)

/** \\brief  10194, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM6_CH3_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110194u)

/** \\brief  10198, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM6_CH3_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110198u)

/** \\brief  10184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110184u)

/** \\brief  101A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM6_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01101A4u)

/** \\brief  101A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM6_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01101A8u)

/** \\brief  101AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM6_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01101ACu)

/** \\brief  101A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM6_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01101A0u)

/** \\brief  10180, ATOM Channel ARU Read Address Register */
#define GTM_ATOM6_CH3_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110180u)

/** \\brief  10184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH3_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0110184u)

/** Alias (User Manual Name) for GTM_ATOM6_CH3_SOMC.
* To use register names with standard convension, please use GTM_ATOM6_CH3_SOMC.
*/
#define	GTM_ATOM6_CH3_CTRL_SOMC	(GTM_ATOM6_CH3_SOMC)

/** \\brief  10184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH3_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF0110184u)

/** Alias (User Manual Name) for GTM_ATOM6_CH3_SOMI.
* To use register names with standard convension, please use GTM_ATOM6_CH3_SOMI.
*/
#define	GTM_ATOM6_CH3_CTRL_SOMI	(GTM_ATOM6_CH3_SOMI)

/** \\brief  10184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH3_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF0110184u)

/** Alias (User Manual Name) for GTM_ATOM6_CH3_SOMP.
* To use register names with standard convension, please use GTM_ATOM6_CH3_SOMP.
*/
#define	GTM_ATOM6_CH3_CTRL_SOMP	(GTM_ATOM6_CH3_SOMP)

/** \\brief  10184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH3_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF0110184u)

