HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM6_CH3_SOMS.
* To use register names with standard convension, please use GTM_ATOM6_CH3_SOMS.
*/
#define	GTM_ATOM6_CH3_CTRL_SOMS	(GTM_ATOM6_CH3_SOMS)

/** \\brief  10188, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH3_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110188u)

/** \\brief  1018C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH3_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011018Cu)

/** \\brief  1019C, ATOM Channel Status Register */
#define GTM_ATOM6_CH3_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011019Cu)

/** \\brief  10210, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM6_CH4_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110210u)

/** \\brief  10214, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM6_CH4_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110214u)

/** \\brief  10218, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM6_CH4_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110218u)

/** \\brief  10204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110204u)

/** \\brief  10224, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM6_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0110224u)

/** \\brief  10228, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM6_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0110228u)

/** \\brief  1022C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM6_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF011022Cu)

/** \\brief  10220, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM6_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0110220u)

/** \\brief  10200, ATOM Channel ARU Read Address Register */
#define GTM_ATOM6_CH4_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110200u)

/** \\brief  10204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH4_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0110204u)

/** Alias (User Manual Name) for GTM_ATOM6_CH4_SOMC.
* To use register names with standard convension, please use GTM_ATOM6_CH4_SOMC.
*/
#define	GTM_ATOM6_CH4_CTRL_SOMC	(GTM_ATOM6_CH4_SOMC)

/** \\brief  10204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH4_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF0110204u)

/** Alias (User Manual Name) for GTM_ATOM6_CH4_SOMI.
* To use register names with standard convension, please use GTM_ATOM6_CH4_SOMI.
*/
#define	GTM_ATOM6_CH4_CTRL_SOMI	(GTM_ATOM6_CH4_SOMI)

/** \\brief  10204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH4_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF0110204u)

/** Alias (User Manual Name) for GTM_ATOM6_CH4_SOMP.
* To use register names with standard convension, please use GTM_ATOM6_CH4_SOMP.
*/
#define	GTM_ATOM6_CH4_CTRL_SOMP	(GTM_ATOM6_CH4_SOMP)

/** \\brief  10204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH4_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF0110204u)

/** Alias (User Manual Name) for GTM_ATOM6_CH4_SOMS.
* To use register names with standard convension, please use GTM_ATOM6_CH4_SOMS.
*/
#define	GTM_ATOM6_CH4_CTRL_SOMS	(GTM_ATOM6_CH4_SOMS)

/** \\brief  10208, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH4_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110208u)

/** \\brief  1020C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH4_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011020Cu)

/** \\brief  1021C, ATOM Channel Status Register */
#define GTM_ATOM6_CH4_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011021Cu)

/** \\brief  10290, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM6_CH5_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110290u)

/** \\brief  10294, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM6_CH5_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110294u)

/** \\brief  10298, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM6_CH5_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110298u)

/** \\brief  10284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110284u)

/** \\brief  102A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM6_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01102A4u)

/** \\brief  102A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM6_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01102A8u)

/** \\brief  102AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM6_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01102ACu)

/** \\brief  102A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM6_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01102A0u)

/** \\brief  10280, ATOM Channel ARU Read Address Register */
#define GTM_ATOM6_CH5_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110280u)

/** \\brief  10284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH5_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0110284u)

/** Alias (User Manual Name) for GTM_ATOM6_CH5_SOMC.
* To use register names with standard convension, please use GTM_ATOM6_CH5_SOMC.
*/
#define	GTM_ATOM6_CH5_CTRL_SOMC	(GTM_ATOM6_CH5_SOMC)

/** \\brief  10284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH5_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF0110284u)

/** Alias (User Manual Name) for GTM_ATOM6_CH5_SOMI.
* To use register names with standard convension, please use GTM_ATOM6_CH5_SOMI.
*/
#define	GTM_ATOM6_CH5_CTRL_SOMI	(GTM_ATOM6_CH5_SOMI)

/** \\brief  10284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH5_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF0110284u)

/** Alias (User Manual Name) for GTM_ATOM6_CH5_SOMP.
* To use register names with standard convension, please use GTM_ATOM6_CH5_SOMP.
*/
#define	GTM_ATOM6_CH5_CTRL_SOMP	(GTM_ATOM6_CH5_SOMP)

/** \\brief  10284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH5_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF0110284u)

/** Alias (User Manual Name) for GTM_ATOM6_CH5_SOMS.
* To use register names with standard convension, please use GTM_ATOM6_CH5_SOMS.
*/
#define	GTM_ATOM6_CH5_CTRL_SOMS	(GTM_ATOM6_CH5_SOMS)

/** \\brief  10288, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH5_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110288u)

/** \\brief  1028C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH5_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011028Cu)

/** \\brief  1029C, ATOM Channel Status Register */
#define GTM_ATOM6_CH5_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011029Cu)

/** \\brief  10310, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM6_CH6_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110310u)

