HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  10314, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM6_CH6_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110314u)

/** \\brief  10318, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM6_CH6_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110318u)

/** \\brief  10304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110304u)

/** \\brief  10324, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM6_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0110324u)

/** \\brief  10328, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM6_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0110328u)

/** \\brief  1032C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM6_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF011032Cu)

/** \\brief  10320, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM6_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0110320u)

/** \\brief  10300, ATOM Channel ARU Read Address Register */
#define GTM_ATOM6_CH6_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110300u)

/** \\brief  10304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH6_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0110304u)

/** Alias (User Manual Name) for GTM_ATOM6_CH6_SOMC.
* To use register names with standard convension, please use GTM_ATOM6_CH6_SOMC.
*/
#define	GTM_ATOM6_CH6_CTRL_SOMC	(GTM_ATOM6_CH6_SOMC)

/** \\brief  10304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH6_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF0110304u)

/** Alias (User Manual Name) for GTM_ATOM6_CH6_SOMI.
* To use register names with standard convension, please use GTM_ATOM6_CH6_SOMI.
*/
#define	GTM_ATOM6_CH6_CTRL_SOMI	(GTM_ATOM6_CH6_SOMI)

/** \\brief  10304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH6_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF0110304u)

/** Alias (User Manual Name) for GTM_ATOM6_CH6_SOMP.
* To use register names with standard convension, please use GTM_ATOM6_CH6_SOMP.
*/
#define	GTM_ATOM6_CH6_CTRL_SOMP	(GTM_ATOM6_CH6_SOMP)

/** \\brief  10304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH6_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF0110304u)

/** Alias (User Manual Name) for GTM_ATOM6_CH6_SOMS.
* To use register names with standard convension, please use GTM_ATOM6_CH6_SOMS.
*/
#define	GTM_ATOM6_CH6_CTRL_SOMS	(GTM_ATOM6_CH6_SOMS)

/** \\brief  10308, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH6_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110308u)

/** \\brief  1030C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH6_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011030Cu)

/** \\brief  1031C, ATOM Channel Status Register */
#define GTM_ATOM6_CH6_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011031Cu)

/** \\brief  10390, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM6_CH7_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110390u)

/** \\brief  10394, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM6_CH7_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110394u)

/** \\brief  10398, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM6_CH7_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110398u)

/** \\brief  10384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110384u)

/** \\brief  103A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM6_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01103A4u)

/** \\brief  103A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM6_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01103A8u)

/** \\brief  103AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM6_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01103ACu)

/** \\brief  103A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM6_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01103A0u)

/** \\brief  10380, ATOM Channel ARU Read Address Register */
#define GTM_ATOM6_CH7_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110380u)

/** \\brief  10384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH7_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0110384u)

/** Alias (User Manual Name) for GTM_ATOM6_CH7_SOMC.
* To use register names with standard convension, please use GTM_ATOM6_CH7_SOMC.
*/
#define	GTM_ATOM6_CH7_CTRL_SOMC	(GTM_ATOM6_CH7_SOMC)

/** \\brief  10384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH7_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF0110384u)

/** Alias (User Manual Name) for GTM_ATOM6_CH7_SOMI.
* To use register names with standard convension, please use GTM_ATOM6_CH7_SOMI.
*/
#define	GTM_ATOM6_CH7_CTRL_SOMI	(GTM_ATOM6_CH7_SOMI)

/** \\brief  10384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH7_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF0110384u)

/** Alias (User Manual Name) for GTM_ATOM6_CH7_SOMP.
* To use register names with standard convension, please use GTM_ATOM6_CH7_SOMP.
*/
#define	GTM_ATOM6_CH7_CTRL_SOMP	(GTM_ATOM6_CH7_SOMP)

/** \\brief  10384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH7_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF0110384u)

/** Alias (User Manual Name) for GTM_ATOM6_CH7_SOMS.
* To use register names with standard convension, please use GTM_ATOM6_CH7_SOMS.
*/
#define	GTM_ATOM6_CH7_CTRL_SOMS	(GTM_ATOM6_CH7_SOMS)

/** \\brief  10388, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH7_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110388u)

/** \\brief  1038C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH7_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011038Cu)

/** \\brief  1039C, ATOM Channel Status Register */
#define GTM_ATOM6_CH7_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011039Cu)

/** \\brief  1084C, TOM TGC0 Action Time Base Register */
#define GTM_ATOM7_AGC_ACT_TB /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB*)0xF011084Cu)

