HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  10844, ATOM AGC Enable/Disable Control Register */
#define GTM_ATOM7_AGC_ENDIS_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL*)0xF0110844u)

/** \\brief  10848, ATOM AGC Enable/Disable Status Register */
#define GTM_ATOM7_AGC_ENDIS_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT*)0xF0110848u)

/** \\brief  10858, ATOM AGC Force Update Control Register */
#define GTM_ATOM7_AGC_FUPD_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL*)0xF0110858u)

/** \\brief  10840, ATOM AGC Global control register */
#define GTM_ATOM7_AGC_GLB_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL*)0xF0110840u)

/** \\brief  1085C, ATOM AGC Internal Trigger Control Register */
#define GTM_ATOM7_AGC_INT_TRIG /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG*)0xF011085Cu)

/** \\brief  10850, ATOM AGC Output Enable Control Register */
#define GTM_ATOM7_AGC_OUTEN_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL*)0xF0110850u)

/** \\brief  10854, ATOM AGC Output Enable Status Register */
#define GTM_ATOM7_AGC_OUTEN_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT*)0xF0110854u)

/** \\brief  10810, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM7_CH0_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110810u)

/** \\brief  10814, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM7_CH0_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110814u)

/** \\brief  10818, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM7_CH0_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110818u)

/** \\brief  10804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH0_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110804u)

/** \\brief  10824, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM7_CH0_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0110824u)

/** \\brief  10828, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM7_CH0_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0110828u)

/** \\brief  1082C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM7_CH0_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF011082Cu)

/** \\brief  10820, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM7_CH0_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0110820u)

/** \\brief  10800, ATOM Channel ARU Read Address Register */
#define GTM_ATOM7_CH0_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110800u)

/** \\brief  10804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH0_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0110804u)

/** Alias (User Manual Name) for GTM_ATOM7_CH0_SOMC.
* To use register names with standard convension, please use GTM_ATOM7_CH0_SOMC.
*/
#define	GTM_ATOM7_CH0_CTRL_SOMC	(GTM_ATOM7_CH0_SOMC)

/** \\brief  10804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH0_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF0110804u)

/** Alias (User Manual Name) for GTM_ATOM7_CH0_SOMI.
* To use register names with standard convension, please use GTM_ATOM7_CH0_SOMI.
*/
#define	GTM_ATOM7_CH0_CTRL_SOMI	(GTM_ATOM7_CH0_SOMI)

/** \\brief  10804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH0_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF0110804u)

/** Alias (User Manual Name) for GTM_ATOM7_CH0_SOMP.
* To use register names with standard convension, please use GTM_ATOM7_CH0_SOMP.
*/
#define	GTM_ATOM7_CH0_CTRL_SOMP	(GTM_ATOM7_CH0_SOMP)

/** \\brief  10804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH0_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF0110804u)

/** Alias (User Manual Name) for GTM_ATOM7_CH0_SOMS.
* To use register names with standard convension, please use GTM_ATOM7_CH0_SOMS.
*/
#define	GTM_ATOM7_CH0_CTRL_SOMS	(GTM_ATOM7_CH0_SOMS)

/** \\brief  10808, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH0_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110808u)

/** \\brief  1080C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH0_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011080Cu)

/** \\brief  1081C, ATOM Channel Status Register */
#define GTM_ATOM7_CH0_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011081Cu)

/** \\brief  10890, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM7_CH1_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110890u)

/** \\brief  10894, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM7_CH1_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110894u)

/** \\brief  10898, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM7_CH1_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110898u)

/** \\brief  10884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110884u)

/** \\brief  108A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM7_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01108A4u)

/** \\brief  108A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM7_CH1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01108A8u)

/** \\brief  108AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM7_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01108ACu)

/** \\brief  108A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM7_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01108A0u)

/** \\brief  10880, ATOM Channel ARU Read Address Register */
#define GTM_ATOM7_CH1_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110880u)

/** \\brief  10884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH1_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0110884u)

