HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM7_CH3_SOMS.
* To use register names with standard convension, please use GTM_ATOM7_CH3_SOMS.
*/
#define	GTM_ATOM7_CH3_CTRL_SOMS	(GTM_ATOM7_CH3_SOMS)

/** \\brief  10988, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH3_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110988u)

/** \\brief  1098C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH3_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011098Cu)

/** \\brief  1099C, ATOM Channel Status Register */
#define GTM_ATOM7_CH3_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011099Cu)

/** \\brief  10A10, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM7_CH4_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110A10u)

/** \\brief  10A14, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM7_CH4_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110A14u)

/** \\brief  10A18, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM7_CH4_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110A18u)

/** \\brief  10A04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110A04u)

/** \\brief  10A24, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM7_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0110A24u)

/** \\brief  10A28, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM7_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0110A28u)

/** \\brief  10A2C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM7_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF0110A2Cu)

/** \\brief  10A20, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM7_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0110A20u)

/** \\brief  10A00, ATOM Channel ARU Read Address Register */
#define GTM_ATOM7_CH4_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110A00u)

/** \\brief  10A04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH4_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0110A04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH4_SOMC.
* To use register names with standard convension, please use GTM_ATOM7_CH4_SOMC.
*/
#define	GTM_ATOM7_CH4_CTRL_SOMC	(GTM_ATOM7_CH4_SOMC)

/** \\brief  10A04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH4_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF0110A04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH4_SOMI.
* To use register names with standard convension, please use GTM_ATOM7_CH4_SOMI.
*/
#define	GTM_ATOM7_CH4_CTRL_SOMI	(GTM_ATOM7_CH4_SOMI)

/** \\brief  10A04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH4_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF0110A04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH4_SOMP.
* To use register names with standard convension, please use GTM_ATOM7_CH4_SOMP.
*/
#define	GTM_ATOM7_CH4_CTRL_SOMP	(GTM_ATOM7_CH4_SOMP)

/** \\brief  10A04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH4_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF0110A04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH4_SOMS.
* To use register names with standard convension, please use GTM_ATOM7_CH4_SOMS.
*/
#define	GTM_ATOM7_CH4_CTRL_SOMS	(GTM_ATOM7_CH4_SOMS)

/** \\brief  10A08, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH4_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110A08u)

/** \\brief  10A0C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH4_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF0110A0Cu)

/** \\brief  10A1C, ATOM Channel Status Register */
#define GTM_ATOM7_CH4_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF0110A1Cu)

/** \\brief  10A90, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM7_CH5_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110A90u)

/** \\brief  10A94, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM7_CH5_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110A94u)

/** \\brief  10A98, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM7_CH5_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110A98u)

/** \\brief  10A84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110A84u)

/** \\brief  10AA4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM7_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0110AA4u)

/** \\brief  10AA8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM7_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0110AA8u)

/** \\brief  10AAC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM7_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF0110AACu)

/** \\brief  10AA0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM7_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0110AA0u)

/** \\brief  10A80, ATOM Channel ARU Read Address Register */
#define GTM_ATOM7_CH5_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110A80u)

/** \\brief  10A84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH5_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0110A84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH5_SOMC.
* To use register names with standard convension, please use GTM_ATOM7_CH5_SOMC.
*/
#define	GTM_ATOM7_CH5_CTRL_SOMC	(GTM_ATOM7_CH5_SOMC)

/** \\brief  10A84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH5_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF0110A84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH5_SOMI.
* To use register names with standard convension, please use GTM_ATOM7_CH5_SOMI.
*/
#define	GTM_ATOM7_CH5_CTRL_SOMI	(GTM_ATOM7_CH5_SOMI)

/** \\brief  10A84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH5_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF0110A84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH5_SOMP.
* To use register names with standard convension, please use GTM_ATOM7_CH5_SOMP.
*/
#define	GTM_ATOM7_CH5_CTRL_SOMP	(GTM_ATOM7_CH5_SOMP)

/** \\brief  10A84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH5_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF0110A84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH5_SOMS.
* To use register names with standard convension, please use GTM_ATOM7_CH5_SOMS.
*/
#define	GTM_ATOM7_CH5_CTRL_SOMS	(GTM_ATOM7_CH5_SOMS)

/** \\brief  10A88, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH5_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110A88u)

