HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  10A8C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH5_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF0110A8Cu)

/** \\brief  10A9C, ATOM Channel Status Register */
#define GTM_ATOM7_CH5_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF0110A9Cu)

/** \\brief  10B10, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM7_CH6_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110B10u)

/** \\brief  10B14, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM7_CH6_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110B14u)

/** \\brief  10B18, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM7_CH6_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110B18u)

/** \\brief  10B04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110B04u)

/** \\brief  10B24, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM7_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0110B24u)

/** \\brief  10B28, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM7_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0110B28u)

/** \\brief  10B2C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM7_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF0110B2Cu)

/** \\brief  10B20, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM7_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0110B20u)

/** \\brief  10B00, ATOM Channel ARU Read Address Register */
#define GTM_ATOM7_CH6_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110B00u)

/** \\brief  10B04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH6_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0110B04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH6_SOMC.
* To use register names with standard convension, please use GTM_ATOM7_CH6_SOMC.
*/
#define	GTM_ATOM7_CH6_CTRL_SOMC	(GTM_ATOM7_CH6_SOMC)

/** \\brief  10B04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH6_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF0110B04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH6_SOMI.
* To use register names with standard convension, please use GTM_ATOM7_CH6_SOMI.
*/
#define	GTM_ATOM7_CH6_CTRL_SOMI	(GTM_ATOM7_CH6_SOMI)

/** \\brief  10B04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH6_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF0110B04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH6_SOMP.
* To use register names with standard convension, please use GTM_ATOM7_CH6_SOMP.
*/
#define	GTM_ATOM7_CH6_CTRL_SOMP	(GTM_ATOM7_CH6_SOMP)

/** \\brief  10B04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH6_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF0110B04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH6_SOMS.
* To use register names with standard convension, please use GTM_ATOM7_CH6_SOMS.
*/
#define	GTM_ATOM7_CH6_CTRL_SOMS	(GTM_ATOM7_CH6_SOMS)

/** \\brief  10B08, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH6_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110B08u)

/** \\brief  10B0C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH6_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF0110B0Cu)

/** \\brief  10B1C, ATOM Channel Status Register */
#define GTM_ATOM7_CH6_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF0110B1Cu)

/** \\brief  10B90, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM7_CH7_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110B90u)

/** \\brief  10B94, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM7_CH7_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110B94u)

/** \\brief  10B98, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM7_CH7_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110B98u)

/** \\brief  10B84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110B84u)

/** \\brief  10BA4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM7_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0110BA4u)

/** \\brief  10BA8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM7_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0110BA8u)

/** \\brief  10BAC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM7_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF0110BACu)

/** \\brief  10BA0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM7_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0110BA0u)

/** \\brief  10B80, ATOM Channel ARU Read Address Register */
#define GTM_ATOM7_CH7_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110B80u)

/** \\brief  10B84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH7_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0110B84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH7_SOMC.
* To use register names with standard convension, please use GTM_ATOM7_CH7_SOMC.
*/
#define	GTM_ATOM7_CH7_CTRL_SOMC	(GTM_ATOM7_CH7_SOMC)

/** \\brief  10B84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH7_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF0110B84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH7_SOMI.
* To use register names with standard convension, please use GTM_ATOM7_CH7_SOMI.
*/
#define	GTM_ATOM7_CH7_CTRL_SOMI	(GTM_ATOM7_CH7_SOMI)

/** \\brief  10B84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH7_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF0110B84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH7_SOMP.
* To use register names with standard convension, please use GTM_ATOM7_CH7_SOMP.
*/
#define	GTM_ATOM7_CH7_CTRL_SOMP	(GTM_ATOM7_CH7_SOMP)

