HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  10B84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH7_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF0110B84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH7_SOMS.
* To use register names with standard convension, please use GTM_ATOM7_CH7_SOMS.
*/
#define	GTM_ATOM7_CH7_CTRL_SOMS	(GTM_ATOM7_CH7_SOMS)

/** \\brief  10B88, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH7_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110B88u)

/** \\brief  10B8C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH7_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF0110B8Cu)

/** \\brief  10B9C, ATOM Channel Status Register */
#define GTM_ATOM7_CH7_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF0110B9Cu)

/** \\brief  1104C, TOM TGC0 Action Time Base Register */
#define GTM_ATOM8_AGC_ACT_TB /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB*)0xF011104Cu)

/** \\brief  11044, ATOM AGC Enable/Disable Control Register */
#define GTM_ATOM8_AGC_ENDIS_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL*)0xF0111044u)

/** \\brief  11048, ATOM AGC Enable/Disable Status Register */
#define GTM_ATOM8_AGC_ENDIS_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT*)0xF0111048u)

/** \\brief  11058, ATOM AGC Force Update Control Register */
#define GTM_ATOM8_AGC_FUPD_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL*)0xF0111058u)

/** \\brief  11040, ATOM AGC Global control register */
#define GTM_ATOM8_AGC_GLB_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL*)0xF0111040u)

/** \\brief  1105C, ATOM AGC Internal Trigger Control Register */
#define GTM_ATOM8_AGC_INT_TRIG /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG*)0xF011105Cu)

/** \\brief  11050, ATOM AGC Output Enable Control Register */
#define GTM_ATOM8_AGC_OUTEN_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL*)0xF0111050u)

/** \\brief  11054, ATOM AGC Output Enable Status Register */
#define GTM_ATOM8_AGC_OUTEN_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT*)0xF0111054u)

/** \\brief  11010, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM8_CH0_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0111010u)

/** \\brief  11014, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM8_CH0_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0111014u)

/** \\brief  11018, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM8_CH0_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0111018u)

/** \\brief  11004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH0_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0111004u)

/** \\brief  11024, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM8_CH0_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0111024u)

/** \\brief  11028, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM8_CH0_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0111028u)

/** \\brief  1102C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM8_CH0_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF011102Cu)

/** \\brief  11020, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM8_CH0_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0111020u)

/** \\brief  11000, ATOM Channel ARU Read Address Register */
#define GTM_ATOM8_CH0_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0111000u)

/** \\brief  11004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH0_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0111004u)

/** Alias (User Manual Name) for GTM_ATOM8_CH0_SOMC.
* To use register names with standard convension, please use GTM_ATOM8_CH0_SOMC.
*/
#define	GTM_ATOM8_CH0_CTRL_SOMC	(GTM_ATOM8_CH0_SOMC)

/** \\brief  11004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH0_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF0111004u)

/** Alias (User Manual Name) for GTM_ATOM8_CH0_SOMI.
* To use register names with standard convension, please use GTM_ATOM8_CH0_SOMI.
*/
#define	GTM_ATOM8_CH0_CTRL_SOMI	(GTM_ATOM8_CH0_SOMI)

/** \\brief  11004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH0_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF0111004u)

/** Alias (User Manual Name) for GTM_ATOM8_CH0_SOMP.
* To use register names with standard convension, please use GTM_ATOM8_CH0_SOMP.
*/
#define	GTM_ATOM8_CH0_CTRL_SOMP	(GTM_ATOM8_CH0_SOMP)

/** \\brief  11004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH0_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF0111004u)

/** Alias (User Manual Name) for GTM_ATOM8_CH0_SOMS.
* To use register names with standard convension, please use GTM_ATOM8_CH0_SOMS.
*/
#define	GTM_ATOM8_CH0_CTRL_SOMS	(GTM_ATOM8_CH0_SOMS)

/** \\brief  11008, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM8_CH0_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0111008u)

/** \\brief  1100C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM8_CH0_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011100Cu)

/** \\brief  1101C, ATOM Channel Status Register */
#define GTM_ATOM8_CH0_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011101Cu)

/** \\brief  11090, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM8_CH1_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0111090u)

/** \\brief  11094, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM8_CH1_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0111094u)

/** \\brief  11098, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM8_CH1_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0111098u)

/** \\brief  11084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0111084u)

/** \\brief  110A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM8_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01110A4u)

