HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  11198, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM8_CH3_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0111198u)

/** \\brief  11184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0111184u)

/** \\brief  111A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM8_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01111A4u)

/** \\brief  111A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM8_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01111A8u)

/** \\brief  111AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM8_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01111ACu)

/** \\brief  111A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM8_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01111A0u)

/** \\brief  11180, ATOM Channel ARU Read Address Register */
#define GTM_ATOM8_CH3_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0111180u)

/** \\brief  11184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH3_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0111184u)

/** Alias (User Manual Name) for GTM_ATOM8_CH3_SOMC.
* To use register names with standard convension, please use GTM_ATOM8_CH3_SOMC.
*/
#define	GTM_ATOM8_CH3_CTRL_SOMC	(GTM_ATOM8_CH3_SOMC)

/** \\brief  11184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH3_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF0111184u)

/** Alias (User Manual Name) for GTM_ATOM8_CH3_SOMI.
* To use register names with standard convension, please use GTM_ATOM8_CH3_SOMI.
*/
#define	GTM_ATOM8_CH3_CTRL_SOMI	(GTM_ATOM8_CH3_SOMI)

/** \\brief  11184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH3_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF0111184u)

/** Alias (User Manual Name) for GTM_ATOM8_CH3_SOMP.
* To use register names with standard convension, please use GTM_ATOM8_CH3_SOMP.
*/
#define	GTM_ATOM8_CH3_CTRL_SOMP	(GTM_ATOM8_CH3_SOMP)

/** \\brief  11184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH3_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF0111184u)

/** Alias (User Manual Name) for GTM_ATOM8_CH3_SOMS.
* To use register names with standard convension, please use GTM_ATOM8_CH3_SOMS.
*/
#define	GTM_ATOM8_CH3_CTRL_SOMS	(GTM_ATOM8_CH3_SOMS)

/** \\brief  11188, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM8_CH3_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0111188u)

/** \\brief  1118C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM8_CH3_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011118Cu)

/** \\brief  1119C, ATOM Channel Status Register */
#define GTM_ATOM8_CH3_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011119Cu)

/** \\brief  11210, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM8_CH4_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0111210u)

/** \\brief  11214, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM8_CH4_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0111214u)

/** \\brief  11218, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM8_CH4_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0111218u)

/** \\brief  11204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0111204u)

/** \\brief  11224, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM8_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0111224u)

/** \\brief  11228, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM8_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0111228u)

/** \\brief  1122C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM8_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF011122Cu)

/** \\brief  11220, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM8_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0111220u)

/** \\brief  11200, ATOM Channel ARU Read Address Register */
#define GTM_ATOM8_CH4_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0111200u)

/** \\brief  11204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH4_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0111204u)

/** Alias (User Manual Name) for GTM_ATOM8_CH4_SOMC.
* To use register names with standard convension, please use GTM_ATOM8_CH4_SOMC.
*/
#define	GTM_ATOM8_CH4_CTRL_SOMC	(GTM_ATOM8_CH4_SOMC)

/** \\brief  11204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH4_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF0111204u)

/** Alias (User Manual Name) for GTM_ATOM8_CH4_SOMI.
* To use register names with standard convension, please use GTM_ATOM8_CH4_SOMI.
*/
#define	GTM_ATOM8_CH4_CTRL_SOMI	(GTM_ATOM8_CH4_SOMI)

/** \\brief  11204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH4_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF0111204u)

/** Alias (User Manual Name) for GTM_ATOM8_CH4_SOMP.
* To use register names with standard convension, please use GTM_ATOM8_CH4_SOMP.
*/
#define	GTM_ATOM8_CH4_CTRL_SOMP	(GTM_ATOM8_CH4_SOMP)

/** \\brief  11204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH4_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF0111204u)

/** Alias (User Manual Name) for GTM_ATOM8_CH4_SOMS.
* To use register names with standard convension, please use GTM_ATOM8_CH4_SOMS.
*/
#define	GTM_ATOM8_CH4_CTRL_SOMS	(GTM_ATOM8_CH4_SOMS)

/** \\brief  11208, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM8_CH4_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0111208u)

/** \\brief  1120C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM8_CH4_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011120Cu)

/** \\brief  1121C, ATOM Channel Status Register */
#define GTM_ATOM8_CH4_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011121Cu)

