HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  1131C, ATOM Channel Status Register */
#define GTM_ATOM8_CH6_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011131Cu)

/** \\brief  11390, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM8_CH7_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0111390u)

/** \\brief  11394, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM8_CH7_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0111394u)

/** \\brief  11398, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM8_CH7_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0111398u)

/** \\brief  11384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0111384u)

/** \\brief  113A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM8_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01113A4u)

/** \\brief  113A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM8_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01113A8u)

/** \\brief  113AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM8_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01113ACu)

/** \\brief  113A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM8_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01113A0u)

/** \\brief  11380, ATOM Channel ARU Read Address Register */
#define GTM_ATOM8_CH7_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0111380u)

/** \\brief  11384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH7_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF0111384u)

/** Alias (User Manual Name) for GTM_ATOM8_CH7_SOMC.
* To use register names with standard convension, please use GTM_ATOM8_CH7_SOMC.
*/
#define	GTM_ATOM8_CH7_CTRL_SOMC	(GTM_ATOM8_CH7_SOMC)

/** \\brief  11384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH7_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF0111384u)

/** Alias (User Manual Name) for GTM_ATOM8_CH7_SOMI.
* To use register names with standard convension, please use GTM_ATOM8_CH7_SOMI.
*/
#define	GTM_ATOM8_CH7_CTRL_SOMI	(GTM_ATOM8_CH7_SOMI)

/** \\brief  11384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH7_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF0111384u)

/** Alias (User Manual Name) for GTM_ATOM8_CH7_SOMP.
* To use register names with standard convension, please use GTM_ATOM8_CH7_SOMP.
*/
#define	GTM_ATOM8_CH7_CTRL_SOMP	(GTM_ATOM8_CH7_SOMP)

/** \\brief  11384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH7_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF0111384u)

/** Alias (User Manual Name) for GTM_ATOM8_CH7_SOMS.
* To use register names with standard convension, please use GTM_ATOM8_CH7_SOMS.
*/
#define	GTM_ATOM8_CH7_CTRL_SOMS	(GTM_ATOM8_CH7_SOMS)

/** \\brief  11388, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM8_CH7_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0111388u)

/** \\brief  1138C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM8_CH7_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011138Cu)

/** \\brief  1139C, ATOM Channel Status Register */
#define GTM_ATOM8_CH7_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011139Cu)

/** \\brief  474, BRC Error Interrupt Enable Register */
#define GTM_BRC_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_EIRQ_EN*)0xF0100474u)

/** \\brief  464, BRC Interrupt Enable Register */
#define GTM_BRC_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_IRQ_EN*)0xF0100464u)

/** \\brief  468, BRC_DEST_ERR Forcing Interrupt Register */
#define GTM_BRC_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_IRQ_FORCINT*)0xF0100468u)

/** \\brief  46C, BRC IRQ Mode Configuration Register */
#define GTM_BRC_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_IRQ_MODE*)0xF010046Cu)

/** \\brief  460, BRC Interrupt Notification Register */
#define GTM_BRC_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_IRQ_NOTIFY*)0xF0100460u)

/** \\brief  470, BRC Software Reset Register */
#define GTM_BRC_RST /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_RST*)0xF0100470u)

/** \\brief  400, Read Address For Input Channel 0 */
#define GTM_BRC_SRC0_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC0_ADDR*)0xF0100400u)

/** \\brief  404, Destination Channels For Input Channel 0 */
#define GTM_BRC_SRC0_DEST /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC0_DEST*)0xF0100404u)

/** \\brief  450, Read Address For Input Channel 10 */
#define GTM_BRC_SRC10_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC10_ADDR*)0xF0100450u)

/** \\brief  454, Destination Channels For Input Channel 10 */
#define GTM_BRC_SRC10_DEST /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC10_DEST*)0xF0100454u)

/** \\brief  458, Read Address For Input Channel 11 */
#define GTM_BRC_SRC11_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC11_ADDR*)0xF0100458u)

/** \\brief  45C, Destination Channels For Input Channel 11 */
#define GTM_BRC_SRC11_DEST /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC11_DEST*)0xF010045Cu)

/** \\brief  408, Read Address For Input Channel 1 */
#define GTM_BRC_SRC1_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC1_ADDR*)0xF0100408u)

/** \\brief  40C, Destination Channels For Input Channel 1 */
#define GTM_BRC_SRC1_DEST /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC1_DEST*)0xF010040Cu)

/** \\brief  410, Read Address For Input Channel 2 */
#define GTM_BRC_SRC2_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC2_ADDR*)0xF0100410u)

/** \\brief  414, Destination Channels For Input Channel 2 */
#define GTM_BRC_SRC2_DEST /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC2_DEST*)0xF0100414u)

/** \\brief  418, Read Address For Input Channel 3 */
#define GTM_BRC_SRC3_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC3_ADDR*)0xF0100418u)

/** \\brief  41C, Destination Channels For Input Channel 3 */
#define GTM_BRC_SRC3_DEST /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC3_DEST*)0xF010041Cu)

