HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  289DC, DPLL Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S55 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289DCu)

/** \\brief  289E0, DPLL Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S56 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289E0u)

/** \\brief  289E4, DPLL Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S57 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289E4u)

/** \\brief  289E8, DPLL Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S58 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289E8u)

/** \\brief  289EC, DPLL Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S59 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289ECu)

/** \\brief  28918, DPLL Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128918u)

/** \\brief  289F0, DPLL Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S60 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289F0u)

/** \\brief  289F4, DPLL Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S61 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289F4u)

/** \\brief  289F8, DPLL Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S62 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289F8u)

/** \\brief  289FC, DPLL Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S63 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289FCu)

/** \\brief  2891C, DPLL Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S7 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012891Cu)

/** \\brief  28920, DPLL Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S8 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128920u)

/** \\brief  28924, DPLL Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S9 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128924u)

/** \\brief  2847C, DPLL Duration of Last STATE Increment [DT_S_ACT] */
#define GTM_DPLL_DT_S_ACT /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S_ACT*)0xF012847Cu)

/** \\brief  28478, DPLL Duration of Last TRIGGER Increment */
#define GTM_DPLL_DT_T_ACT /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_T_ACT*)0xF0128478u)

/** \\brief  28380, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF0128380u)

/** \\brief  28384, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF0128384u)

/** \\brief  283A8, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283A8u)

/** \\brief  283AC, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283ACu)

/** \\brief  283B0, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283B0u)

/** \\brief  283B4, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283B4u)

/** \\brief  283B8, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283B8u)

/** \\brief  283BC, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283BCu)

/** \\brief  283C0, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283C0u)

/** \\brief  283C4, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283C4u)

/** \\brief  283C8, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283C8u)

/** \\brief  283CC, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283CCu)

/** \\brief  28388, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF0128388u)

/** \\brief  283D0, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283D0u)

/** \\brief  283D4, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283D4u)

/** \\brief  283D8, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283D8u)

/** \\brief  283DC, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283DCu)

/** \\brief  283E0, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA24 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283E0u)

/** \\brief  283E4, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA25 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283E4u)

/** \\brief  283E8, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA26 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283E8u)

/** \\brief  283EC, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA27 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283ECu)

/** \\brief  283F0, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA28 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283F0u)

/** \\brief  283F4, DPLL Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA29 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283F4u)

