HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  1C4B0, FIFO0 Channel IRQ Mode Control Register */
#define GTM_FIFO1_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE*)0xF011C4B0u)

/** \\brief  1C4A4, FIFO0 Channel Interrupt Notification Register */
#define GTM_FIFO1_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY*)0xF011C4A4u)

/** \\brief  1C490, FIFO0 Channel Lower Watermark Register */
#define GTM_FIFO1_CH2_LOWER_WM /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM*)0xF011C490u)

/** \\brief  1C4A0, FIFO0 Channel Read Pointer Register */
#define GTM_FIFO1_CH2_RD_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR*)0xF011C4A0u)

/** \\brief  1C488, FIFO0 Channel Start Address Register */
#define GTM_FIFO1_CH2_START_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR*)0xF011C488u)

/** \\brief  1C494, FIFO0 Channel Status Register */
#define GTM_FIFO1_CH2_STATUS /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS*)0xF011C494u)

/** \\brief  1C48C, FIFO0 Channel Upper Watermark Register */
#define GTM_FIFO1_CH2_UPPER_WM /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM*)0xF011C48Cu)

/** \\brief  1C49C, FIFO0 Channel Write Pointer Register */
#define GTM_FIFO1_CH2_WR_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR*)0xF011C49Cu)

/** \\brief  1C4C0, FIFO0 Channel Control Register */
#define GTM_FIFO1_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL*)0xF011C4C0u)

/** \\brief  1C4F4, FIFO0 Channel Error Interrupt Enable Register */
#define GTM_FIFO1_CH3_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN*)0xF011C4F4u)

/** \\brief  1C4C4, FIFO0 Channel End Address Register */
#define GTM_FIFO1_CH3_END_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR*)0xF011C4C4u)

/** \\brief  1C4D8, FIFO0 Channel Fill Level Register */
#define GTM_FIFO1_CH3_FILL_LEVEL /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL*)0xF011C4D8u)

/** \\brief  1C4E8, FIFO0 Channel Interrupt Enable Register */
#define GTM_FIFO1_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN*)0xF011C4E8u)

/** \\brief  1C4EC, FIFO0 Channel Force Interrupt By Software Register */
#define GTM_FIFO1_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT*)0xF011C4ECu)

/** \\brief  1C4F0, FIFO0 Channel IRQ Mode Control Register */
#define GTM_FIFO1_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE*)0xF011C4F0u)

/** \\brief  1C4E4, FIFO0 Channel Interrupt Notification Register */
#define GTM_FIFO1_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY*)0xF011C4E4u)

/** \\brief  1C4D0, FIFO0 Channel Lower Watermark Register */
#define GTM_FIFO1_CH3_LOWER_WM /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM*)0xF011C4D0u)

/** \\brief  1C4E0, FIFO0 Channel Read Pointer Register */
#define GTM_FIFO1_CH3_RD_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR*)0xF011C4E0u)

/** \\brief  1C4C8, FIFO0 Channel Start Address Register */
#define GTM_FIFO1_CH3_START_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR*)0xF011C4C8u)

/** \\brief  1C4D4, FIFO0 Channel Status Register */
#define GTM_FIFO1_CH3_STATUS /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS*)0xF011C4D4u)

/** \\brief  1C4CC, FIFO0 Channel Upper Watermark Register */
#define GTM_FIFO1_CH3_UPPER_WM /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM*)0xF011C4CCu)

/** \\brief  1C4DC, FIFO0 Channel Write Pointer Register */
#define GTM_FIFO1_CH3_WR_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR*)0xF011C4DCu)

/** \\brief  1C500, FIFO0 Channel Control Register */
#define GTM_FIFO1_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL*)0xF011C500u)

/** \\brief  1C534, FIFO0 Channel Error Interrupt Enable Register */
#define GTM_FIFO1_CH4_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN*)0xF011C534u)

/** \\brief  1C504, FIFO0 Channel End Address Register */
#define GTM_FIFO1_CH4_END_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR*)0xF011C504u)

/** \\brief  1C518, FIFO0 Channel Fill Level Register */
#define GTM_FIFO1_CH4_FILL_LEVEL /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL*)0xF011C518u)

/** \\brief  1C528, FIFO0 Channel Interrupt Enable Register */
#define GTM_FIFO1_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN*)0xF011C528u)

/** \\brief  1C52C, FIFO0 Channel Force Interrupt By Software Register */
#define GTM_FIFO1_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT*)0xF011C52Cu)

/** \\brief  1C530, FIFO0 Channel IRQ Mode Control Register */
#define GTM_FIFO1_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE*)0xF011C530u)

/** \\brief  1C524, FIFO0 Channel Interrupt Notification Register */
#define GTM_FIFO1_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY*)0xF011C524u)

/** \\brief  1C510, FIFO0 Channel Lower Watermark Register */
#define GTM_FIFO1_CH4_LOWER_WM /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM*)0xF011C510u)

/** \\brief  1C520, FIFO0 Channel Read Pointer Register */
#define GTM_FIFO1_CH4_RD_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR*)0xF011C520u)

/** \\brief  1C508, FIFO0 Channel Start Address Register */
#define GTM_FIFO1_CH4_START_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR*)0xF011C508u)

/** \\brief  1C514, FIFO0 Channel Status Register */
#define GTM_FIFO1_CH4_STATUS /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS*)0xF011C514u)

/** \\brief  1C50C, FIFO0 Channel Upper Watermark Register */
#define GTM_FIFO1_CH4_UPPER_WM /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM*)0xF011C50Cu)

/** \\brief  1C51C, FIFO0 Channel Write Pointer Register */
#define GTM_FIFO1_CH4_WR_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR*)0xF011C51Cu)

/** \\brief  1C540, FIFO0 Channel Control Register */
#define GTM_FIFO1_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL*)0xF011C540u)

/** \\brief  1C574, FIFO0 Channel Error Interrupt Enable Register */
#define GTM_FIFO1_CH5_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN*)0xF011C574u)

/** \\brief  1C544, FIFO0 Channel End Address Register */
#define GTM_FIFO1_CH5_END_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR*)0xF011C544u)

/** \\brief  1C558, FIFO0 Channel Fill Level Register */
#define GTM_FIFO1_CH5_FILL_LEVEL /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL*)0xF011C558u)

/** \\brief  1C568, FIFO0 Channel Interrupt Enable Register */
#define GTM_FIFO1_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN*)0xF011C568u)

/** \\brief  1C56C, FIFO0 Channel Force Interrupt By Software Register */
#define GTM_FIFO1_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT*)0xF011C56Cu)

/** \\brief  1C570, FIFO0 Channel IRQ Mode Control Register */
#define GTM_FIFO1_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE*)0xF011C570u)

