HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  1C564, FIFO0 Channel Interrupt Notification Register */
#define GTM_FIFO1_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY*)0xF011C564u)

/** \\brief  1C550, FIFO0 Channel Lower Watermark Register */
#define GTM_FIFO1_CH5_LOWER_WM /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM*)0xF011C550u)

/** \\brief  1C560, FIFO0 Channel Read Pointer Register */
#define GTM_FIFO1_CH5_RD_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR*)0xF011C560u)

/** \\brief  1C548, FIFO0 Channel Start Address Register */
#define GTM_FIFO1_CH5_START_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR*)0xF011C548u)

/** \\brief  1C554, FIFO0 Channel Status Register */
#define GTM_FIFO1_CH5_STATUS /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS*)0xF011C554u)

/** \\brief  1C54C, FIFO0 Channel Upper Watermark Register */
#define GTM_FIFO1_CH5_UPPER_WM /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM*)0xF011C54Cu)

/** \\brief  1C55C, FIFO0 Channel Write Pointer Register */
#define GTM_FIFO1_CH5_WR_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR*)0xF011C55Cu)

/** \\brief  1C580, FIFO0 Channel Control Register */
#define GTM_FIFO1_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL*)0xF011C580u)

/** \\brief  1C5B4, FIFO0 Channel Error Interrupt Enable Register */
#define GTM_FIFO1_CH6_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN*)0xF011C5B4u)

/** \\brief  1C584, FIFO0 Channel End Address Register */
#define GTM_FIFO1_CH6_END_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR*)0xF011C584u)

/** \\brief  1C598, FIFO0 Channel Fill Level Register */
#define GTM_FIFO1_CH6_FILL_LEVEL /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL*)0xF011C598u)

/** \\brief  1C5A8, FIFO0 Channel Interrupt Enable Register */
#define GTM_FIFO1_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN*)0xF011C5A8u)

/** \\brief  1C5AC, FIFO0 Channel Force Interrupt By Software Register */
#define GTM_FIFO1_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT*)0xF011C5ACu)

/** \\brief  1C5B0, FIFO0 Channel IRQ Mode Control Register */
#define GTM_FIFO1_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE*)0xF011C5B0u)

/** \\brief  1C5A4, FIFO0 Channel Interrupt Notification Register */
#define GTM_FIFO1_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY*)0xF011C5A4u)

/** \\brief  1C590, FIFO0 Channel Lower Watermark Register */
#define GTM_FIFO1_CH6_LOWER_WM /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM*)0xF011C590u)

/** \\brief  1C5A0, FIFO0 Channel Read Pointer Register */
#define GTM_FIFO1_CH6_RD_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR*)0xF011C5A0u)

/** \\brief  1C588, FIFO0 Channel Start Address Register */
#define GTM_FIFO1_CH6_START_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR*)0xF011C588u)

/** \\brief  1C594, FIFO0 Channel Status Register */
#define GTM_FIFO1_CH6_STATUS /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS*)0xF011C594u)

/** \\brief  1C58C, FIFO0 Channel Upper Watermark Register */
#define GTM_FIFO1_CH6_UPPER_WM /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM*)0xF011C58Cu)

/** \\brief  1C59C, FIFO0 Channel Write Pointer Register */
#define GTM_FIFO1_CH6_WR_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR*)0xF011C59Cu)

/** \\brief  1C5C0, FIFO0 Channel Control Register */
#define GTM_FIFO1_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL*)0xF011C5C0u)

/** \\brief  1C5F4, FIFO0 Channel Error Interrupt Enable Register */
#define GTM_FIFO1_CH7_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN*)0xF011C5F4u)

/** \\brief  1C5C4, FIFO0 Channel End Address Register */
#define GTM_FIFO1_CH7_END_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR*)0xF011C5C4u)

/** \\brief  1C5D8, FIFO0 Channel Fill Level Register */
#define GTM_FIFO1_CH7_FILL_LEVEL /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL*)0xF011C5D8u)

/** \\brief  1C5E8, FIFO0 Channel Interrupt Enable Register */
#define GTM_FIFO1_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN*)0xF011C5E8u)

/** \\brief  1C5EC, FIFO0 Channel Force Interrupt By Software Register */
#define GTM_FIFO1_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT*)0xF011C5ECu)

/** \\brief  1C5F0, FIFO0 Channel IRQ Mode Control Register */
#define GTM_FIFO1_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE*)0xF011C5F0u)

/** \\brief  1C5E4, FIFO0 Channel Interrupt Notification Register */
#define GTM_FIFO1_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY*)0xF011C5E4u)

/** \\brief  1C5D0, FIFO0 Channel Lower Watermark Register */
#define GTM_FIFO1_CH7_LOWER_WM /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM*)0xF011C5D0u)

/** \\brief  1C5E0, FIFO0 Channel Read Pointer Register */
#define GTM_FIFO1_CH7_RD_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR*)0xF011C5E0u)

/** \\brief  1C5C8, FIFO0 Channel Start Address Register */
#define GTM_FIFO1_CH7_START_ADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR*)0xF011C5C8u)

/** \\brief  1C5D4, FIFO0 Channel Status Register */
#define GTM_FIFO1_CH7_STATUS /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS*)0xF011C5D4u)

/** \\brief  1C5CC, FIFO0 Channel Upper Watermark Register */
#define GTM_FIFO1_CH7_UPPER_WM /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM*)0xF011C5CCu)

/** \\brief  1C5DC, FIFO0 Channel Write Pointer Register */
#define GTM_FIFO1_CH7_WR_PTR /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR*)0xF011C5DCu)

/** \\brief  600, GTM Infrastructure Interrupt Group */
#define GTM_ICM_IRQG_0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_0*)0xF0100600u)

/** \\brief  604, GTM DPLL Interrupt Group */
#define GTM_ICM_IRQG_1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_1*)0xF0100604u)

/** \\brief  628, ATOM Interrupt Group 1 */
#define GTM_ICM_IRQG_10 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_10*)0xF0100628u)

