HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  300C, TIM Channel Edge Counter Register */
#define GTM_TIM4_CH0_ECNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010300Cu)

/** \\brief  3028, TIM Channel External Capture Control Register */
#define GTM_TIM4_CH0_ECTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0103028u)

/** \\brief  303C, TIM Channel Error Interrupt Enable Register */
#define GTM_TIM4_CH0_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010303Cu)

/** \\brief  3020, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM4_CH0_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0103020u)

/** \\brief  301C, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM4_CH0_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010301Cu)

/** \\brief  3000, TIM Channel General Purpose 0 Register */
#define GTM_TIM4_CH0_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103000u)

/** \\brief  3004, TIM Channel General Purpose 1 Register */
#define GTM_TIM4_CH0_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103004u)

/** \\brief  3030, TIM Channel Interrupt Enable Register */
#define GTM_TIM4_CH0_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0103030u)

/** \\brief  3034, TIM Channel Software Interrupt Force Register */
#define GTM_TIM4_CH0_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0103034u)

/** \\brief  3038, TIM IRQ Mode Configuration Register */
#define GTM_TIM4_CH0_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0103038u)

/** \\brief  302C, TIM Channel Interrupt Notification Register */
#define GTM_TIM4_CH0_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010302Cu)

/** \\brief  3014, TIM Channel TDUC Register */
#define GTM_TIM4_CH0_TDUC /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103014u)

/** \\brief  3018, TIM Channel TDUV Register */
#define GTM_TIM4_CH0_TDUV /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103018u)

/** \\brief  3088, TIM Channel SMU Counter Register */
#define GTM_TIM4_CH1_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103088u)

/** \\brief  3090, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM4_CH1_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103090u)

/** \\brief  30A4, TIM Channel Control Register */
#define GTM_TIM4_CH1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01030A4u)

/** \\brief  308C, TIM Channel Edge Counter Register */
#define GTM_TIM4_CH1_ECNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010308Cu)

/** \\brief  30A8, TIM Channel External Capture Control Register */
#define GTM_TIM4_CH1_ECTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01030A8u)

/** \\brief  30BC, TIM Channel Error Interrupt Enable Register */
#define GTM_TIM4_CH1_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01030BCu)

/** \\brief  30A0, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM4_CH1_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01030A0u)

/** \\brief  309C, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM4_CH1_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010309Cu)

/** \\brief  3080, TIM Channel General Purpose 0 Register */
#define GTM_TIM4_CH1_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103080u)

/** \\brief  3084, TIM Channel General Purpose 1 Register */
#define GTM_TIM4_CH1_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103084u)

/** \\brief  30B0, TIM Channel Interrupt Enable Register */
#define GTM_TIM4_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01030B0u)

/** \\brief  30B4, TIM Channel Software Interrupt Force Register */
#define GTM_TIM4_CH1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01030B4u)

/** \\brief  30B8, TIM IRQ Mode Configuration Register */
#define GTM_TIM4_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01030B8u)

/** \\brief  30AC, TIM Channel Interrupt Notification Register */
#define GTM_TIM4_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01030ACu)

/** \\brief  3094, TIM Channel TDUC Register */
#define GTM_TIM4_CH1_TDUC /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103094u)

/** \\brief  3098, TIM Channel TDUV Register */
#define GTM_TIM4_CH1_TDUV /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103098u)

/** \\brief  3108, TIM Channel SMU Counter Register */
#define GTM_TIM4_CH2_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103108u)

/** \\brief  3110, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM4_CH2_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103110u)

/** \\brief  3124, TIM Channel Control Register */
#define GTM_TIM4_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0103124u)

/** \\brief  310C, TIM Channel Edge Counter Register */
#define GTM_TIM4_CH2_ECNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010310Cu)

/** \\brief  3128, TIM Channel External Capture Control Register */
#define GTM_TIM4_CH2_ECTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0103128u)

/** \\brief  313C, TIM Channel Error Interrupt Enable Register */
#define GTM_TIM4_CH2_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010313Cu)

/** \\brief  3120, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM4_CH2_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0103120u)

/** \\brief  311C, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM4_CH2_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010311Cu)

/** \\brief  3100, TIM Channel General Purpose 0 Register */
#define GTM_TIM4_CH2_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103100u)

/** \\brief  3104, TIM Channel General Purpose 1 Register */
#define GTM_TIM4_CH2_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103104u)

/** \\brief  3130, TIM Channel Interrupt Enable Register */
#define GTM_TIM4_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0103130u)

/** \\brief  3134, TIM Channel Software Interrupt Force Register */
#define GTM_TIM4_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0103134u)

/** \\brief  3138, TIM IRQ Mode Configuration Register */
#define GTM_TIM4_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0103138u)

/** \\brief  312C, TIM Channel Interrupt Notification Register */
#define GTM_TIM4_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010312Cu)

