HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  3114, TIM Channel TDUC Register */
#define GTM_TIM4_CH2_TDUC /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103114u)

/** \\brief  3118, TIM Channel TDUV Register */
#define GTM_TIM4_CH2_TDUV /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103118u)

/** \\brief  3188, TIM Channel SMU Counter Register */
#define GTM_TIM4_CH3_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103188u)

/** \\brief  3190, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM4_CH3_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103190u)

/** \\brief  31A4, TIM Channel Control Register */
#define GTM_TIM4_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01031A4u)

/** \\brief  318C, TIM Channel Edge Counter Register */
#define GTM_TIM4_CH3_ECNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010318Cu)

/** \\brief  31A8, TIM Channel External Capture Control Register */
#define GTM_TIM4_CH3_ECTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01031A8u)

/** \\brief  31BC, TIM Channel Error Interrupt Enable Register */
#define GTM_TIM4_CH3_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01031BCu)

/** \\brief  31A0, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM4_CH3_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01031A0u)

/** \\brief  319C, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM4_CH3_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010319Cu)

/** \\brief  3180, TIM Channel General Purpose 0 Register */
#define GTM_TIM4_CH3_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103180u)

/** \\brief  3184, TIM Channel General Purpose 1 Register */
#define GTM_TIM4_CH3_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103184u)

/** \\brief  31B0, TIM Channel Interrupt Enable Register */
#define GTM_TIM4_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01031B0u)

/** \\brief  31B4, TIM Channel Software Interrupt Force Register */
#define GTM_TIM4_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01031B4u)

/** \\brief  31B8, TIM IRQ Mode Configuration Register */
#define GTM_TIM4_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01031B8u)

/** \\brief  31AC, TIM Channel Interrupt Notification Register */
#define GTM_TIM4_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01031ACu)

/** \\brief  3194, TIM Channel TDUC Register */
#define GTM_TIM4_CH3_TDUC /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103194u)

/** \\brief  3198, TIM Channel TDUV Register */
#define GTM_TIM4_CH3_TDUV /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103198u)

/** \\brief  3208, TIM Channel SMU Counter Register */
#define GTM_TIM4_CH4_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103208u)

/** \\brief  3210, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM4_CH4_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103210u)

/** \\brief  3224, TIM Channel Control Register */
#define GTM_TIM4_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0103224u)

/** \\brief  320C, TIM Channel Edge Counter Register */
#define GTM_TIM4_CH4_ECNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010320Cu)

/** \\brief  3228, TIM Channel External Capture Control Register */
#define GTM_TIM4_CH4_ECTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0103228u)

/** \\brief  323C, TIM Channel Error Interrupt Enable Register */
#define GTM_TIM4_CH4_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010323Cu)

/** \\brief  3220, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM4_CH4_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0103220u)

/** \\brief  321C, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM4_CH4_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010321Cu)

/** \\brief  3200, TIM Channel General Purpose 0 Register */
#define GTM_TIM4_CH4_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103200u)

/** \\brief  3204, TIM Channel General Purpose 1 Register */
#define GTM_TIM4_CH4_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103204u)

/** \\brief  3230, TIM Channel Interrupt Enable Register */
#define GTM_TIM4_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0103230u)

/** \\brief  3234, TIM Channel Software Interrupt Force Register */
#define GTM_TIM4_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0103234u)

/** \\brief  3238, TIM IRQ Mode Configuration Register */
#define GTM_TIM4_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0103238u)

/** \\brief  322C, TIM Channel Interrupt Notification Register */
#define GTM_TIM4_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010322Cu)

/** \\brief  3214, TIM Channel TDUC Register */
#define GTM_TIM4_CH4_TDUC /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103214u)

/** \\brief  3218, TIM Channel TDUV Register */
#define GTM_TIM4_CH4_TDUV /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103218u)

/** \\brief  3288, TIM Channel SMU Counter Register */
#define GTM_TIM4_CH5_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103288u)

/** \\brief  3290, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM4_CH5_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103290u)

/** \\brief  32A4, TIM Channel Control Register */
#define GTM_TIM4_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01032A4u)

/** \\brief  328C, TIM Channel Edge Counter Register */
#define GTM_TIM4_CH5_ECNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010328Cu)

/** \\brief  32A8, TIM Channel External Capture Control Register */
#define GTM_TIM4_CH5_ECTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01032A8u)

/** \\brief  32BC, TIM Channel Error Interrupt Enable Register */
#define GTM_TIM4_CH5_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01032BCu)

/** \\brief  32A0, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM4_CH5_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01032A0u)

