HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  329C, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM4_CH5_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010329Cu)

/** \\brief  3280, TIM Channel General Purpose 0 Register */
#define GTM_TIM4_CH5_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103280u)

/** \\brief  3284, TIM Channel General Purpose 1 Register */
#define GTM_TIM4_CH5_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103284u)

/** \\brief  32B0, TIM Channel Interrupt Enable Register */
#define GTM_TIM4_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01032B0u)

/** \\brief  32B4, TIM Channel Software Interrupt Force Register */
#define GTM_TIM4_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01032B4u)

/** \\brief  32B8, TIM IRQ Mode Configuration Register */
#define GTM_TIM4_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01032B8u)

/** \\brief  32AC, TIM Channel Interrupt Notification Register */
#define GTM_TIM4_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01032ACu)

/** \\brief  3294, TIM Channel TDUC Register */
#define GTM_TIM4_CH5_TDUC /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103294u)

/** \\brief  3298, TIM Channel TDUV Register */
#define GTM_TIM4_CH5_TDUV /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103298u)

/** \\brief  3308, TIM Channel SMU Counter Register */
#define GTM_TIM4_CH6_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103308u)

/** \\brief  3310, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM4_CH6_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103310u)

/** \\brief  3324, TIM Channel Control Register */
#define GTM_TIM4_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0103324u)

/** \\brief  330C, TIM Channel Edge Counter Register */
#define GTM_TIM4_CH6_ECNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010330Cu)

/** \\brief  3328, TIM Channel External Capture Control Register */
#define GTM_TIM4_CH6_ECTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0103328u)

/** \\brief  333C, TIM Channel Error Interrupt Enable Register */
#define GTM_TIM4_CH6_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010333Cu)

/** \\brief  3320, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM4_CH6_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0103320u)

/** \\brief  331C, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM4_CH6_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010331Cu)

/** \\brief  3300, TIM Channel General Purpose 0 Register */
#define GTM_TIM4_CH6_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103300u)

/** \\brief  3304, TIM Channel General Purpose 1 Register */
#define GTM_TIM4_CH6_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103304u)

/** \\brief  3330, TIM Channel Interrupt Enable Register */
#define GTM_TIM4_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0103330u)

/** \\brief  3334, TIM Channel Software Interrupt Force Register */
#define GTM_TIM4_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0103334u)

/** \\brief  3338, TIM IRQ Mode Configuration Register */
#define GTM_TIM4_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0103338u)

/** \\brief  332C, TIM Channel Interrupt Notification Register */
#define GTM_TIM4_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010332Cu)

/** \\brief  3314, TIM Channel TDUC Register */
#define GTM_TIM4_CH6_TDUC /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103314u)

/** \\brief  3318, TIM Channel TDUV Register */
#define GTM_TIM4_CH6_TDUV /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103318u)

/** \\brief  3388, TIM Channel SMU Counter Register */
#define GTM_TIM4_CH7_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103388u)

/** \\brief  3390, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM4_CH7_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103390u)

/** \\brief  33A4, TIM Channel Control Register */
#define GTM_TIM4_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01033A4u)

/** \\brief  338C, TIM Channel Edge Counter Register */
#define GTM_TIM4_CH7_ECNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010338Cu)

/** \\brief  33A8, TIM Channel External Capture Control Register */
#define GTM_TIM4_CH7_ECTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01033A8u)

/** \\brief  33BC, TIM Channel Error Interrupt Enable Register */
#define GTM_TIM4_CH7_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01033BCu)

/** \\brief  33A0, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM4_CH7_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01033A0u)

/** \\brief  339C, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM4_CH7_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010339Cu)

/** \\brief  3380, TIM Channel General Purpose 0 Register */
#define GTM_TIM4_CH7_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103380u)

/** \\brief  3384, TIM Channel General Purpose 1 Register */
#define GTM_TIM4_CH7_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103384u)

/** \\brief  33B0, TIM Channel Interrupt Enable Register */
#define GTM_TIM4_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01033B0u)

/** \\brief  33B4, TIM Channel Software Interrupt Force Register */
#define GTM_TIM4_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01033B4u)

/** \\brief  33B8, TIM IRQ Mode Configuration Register */
#define GTM_TIM4_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01033B8u)

/** \\brief  33AC, TIM Channel Interrupt Notification Register */
#define GTM_TIM4_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01033ACu)

/** \\brief  3394, TIM Channel TDUC Register */
#define GTM_TIM4_CH7_TDUC /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103394u)

/** \\brief  3398, TIM Channel TDUV Register */
#define GTM_TIM4_CH7_TDUV /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103398u)

/** \\brief  3078, TIM_IN_SRC Long Name */
#define GTM_TIM4_IN_SRC /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_IN_SRC*)0xF0103078u)

/** \\brief  307C, TIM Global Software Reset Register */
#define GTM_TIM4_RST /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_RST*)0xF010307Cu)

/** \\brief  3808, TIM Channel SMU Counter Register */
#define GTM_TIM5_CH0_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103808u)

