HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  9B14, TOM Channel CCU0 Counter Register */
#define GTM_TOM3_CH12_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109B14u)

/** \\brief  9B00, TOM Channel Control Register’ */
#define GTM_TOM3_CH12_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109B00u)

/** \\brief  9B20, TOM Channel Interrupt Enable Register */
#define GTM_TOM3_CH12_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109B20u)

/** \\brief  9B24, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM3_CH12_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109B24u)

/** \\brief  9B28, TOM IRQ Mode Configuration Register */
#define GTM_TOM3_CH12_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109B28u)

/** \\brief  9B1C, TOM Channel Interrupt Notification Register */
#define GTM_TOM3_CH12_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF0109B1Cu)

/** \\brief  9B04, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM3_CH12_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109B04u)

/** \\brief  9B08, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM3_CH12_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109B08u)

/** \\brief  9B18, TOM Channel Status Register */
#define GTM_TOM3_CH12_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109B18u)

/** \\brief  9B4C, TOM Channel CCU0 Compare Register */
#define GTM_TOM3_CH13_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109B4Cu)

/** \\brief  9B50, TOM Channel CCU1 Compare Register */
#define GTM_TOM3_CH13_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109B50u)

/** \\brief  9B54, TOM Channel CCU0 Counter Register */
#define GTM_TOM3_CH13_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109B54u)

/** \\brief  9B40, TOM Channel Control Register’ */
#define GTM_TOM3_CH13_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109B40u)

/** \\brief  9B60, TOM Channel Interrupt Enable Register */
#define GTM_TOM3_CH13_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109B60u)

/** \\brief  9B64, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM3_CH13_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109B64u)

/** \\brief  9B68, TOM IRQ Mode Configuration Register */
#define GTM_TOM3_CH13_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109B68u)

/** \\brief  9B5C, TOM Channel Interrupt Notification Register */
#define GTM_TOM3_CH13_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF0109B5Cu)

/** \\brief  9B44, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM3_CH13_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109B44u)

/** \\brief  9B48, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM3_CH13_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109B48u)

/** \\brief  9B58, TOM Channel Status Register */
#define GTM_TOM3_CH13_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109B58u)

/** \\brief  9B8C, TOM Channel CCU0 Compare Register */
#define GTM_TOM3_CH14_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109B8Cu)

/** \\brief  9B90, TOM Channel CCU1 Compare Register */
#define GTM_TOM3_CH14_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109B90u)

/** \\brief  9B94, TOM Channel CCU0 Counter Register */
#define GTM_TOM3_CH14_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109B94u)

/** \\brief  9B80, TOM Channel Control Register’ */
#define GTM_TOM3_CH14_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109B80u)

/** \\brief  9BA0, TOM Channel Interrupt Enable Register */
#define GTM_TOM3_CH14_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109BA0u)

/** \\brief  9BA4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM3_CH14_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109BA4u)

/** \\brief  9BA8, TOM IRQ Mode Configuration Register */
#define GTM_TOM3_CH14_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109BA8u)

/** \\brief  9B9C, TOM Channel Interrupt Notification Register */
#define GTM_TOM3_CH14_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF0109B9Cu)

/** \\brief  9B84, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM3_CH14_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109B84u)

/** \\brief  9B88, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM3_CH14_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109B88u)

/** \\brief  9B98, TOM Channel Status Register */
#define GTM_TOM3_CH14_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109B98u)

/** \\brief  9BCC, TOM Channel CCU0 Compare Register */
#define GTM_TOM3_CH15_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109BCCu)

/** \\brief  9BD0, TOM Channel CCU1 Compare Register */
#define GTM_TOM3_CH15_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109BD0u)

/** \\brief  9BD4, TOM Channel CCU0 Counter Register */
#define GTM_TOM3_CH15_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109BD4u)

/** \\brief  9BC0, TOM Channel Control Register’ */
#define GTM_TOM3_CH15_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109BC0u)

/** \\brief  9BE0, TOM Channel Interrupt Enable Register */
#define GTM_TOM3_CH15_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109BE0u)

/** \\brief  9BE4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM3_CH15_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109BE4u)

/** \\brief  9BE8, TOM IRQ Mode Configuration Register */
#define GTM_TOM3_CH15_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109BE8u)

/** \\brief  9BDC, TOM Channel Interrupt Notification Register */
#define GTM_TOM3_CH15_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF0109BDCu)

/** \\brief  9BC4, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM3_CH15_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109BC4u)

/** \\brief  9BC8, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM3_CH15_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109BC8u)

