HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  9BD8, TOM Channel Status Register */
#define GTM_TOM3_CH15_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109BD8u)

/** \\brief  984C, TOM Channel CCU0 Compare Register */
#define GTM_TOM3_CH1_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010984Cu)

/** \\brief  9850, TOM Channel CCU1 Compare Register */
#define GTM_TOM3_CH1_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109850u)

/** \\brief  9854, TOM Channel CCU0 Counter Register */
#define GTM_TOM3_CH1_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109854u)

/** \\brief  9840, TOM Channel Control Register’ */
#define GTM_TOM3_CH1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109840u)

/** \\brief  9860, TOM Channel Interrupt Enable Register */
#define GTM_TOM3_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109860u)

/** \\brief  9864, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM3_CH1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109864u)

/** \\brief  9868, TOM IRQ Mode Configuration Register */
#define GTM_TOM3_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109868u)

/** \\brief  985C, TOM Channel Interrupt Notification Register */
#define GTM_TOM3_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010985Cu)

/** \\brief  9844, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM3_CH1_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109844u)

/** \\brief  9848, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM3_CH1_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109848u)

/** \\brief  9858, TOM Channel Status Register */
#define GTM_TOM3_CH1_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109858u)

/** \\brief  988C, TOM Channel CCU0 Compare Register */
#define GTM_TOM3_CH2_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010988Cu)

/** \\brief  9890, TOM Channel CCU1 Compare Register */
#define GTM_TOM3_CH2_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109890u)

/** \\brief  9894, TOM Channel CCU0 Counter Register */
#define GTM_TOM3_CH2_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109894u)

/** \\brief  9880, TOM Channel Control Register’ */
#define GTM_TOM3_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109880u)

/** \\brief  98A0, TOM Channel Interrupt Enable Register */
#define GTM_TOM3_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01098A0u)

/** \\brief  98A4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM3_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01098A4u)

/** \\brief  98A8, TOM IRQ Mode Configuration Register */
#define GTM_TOM3_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01098A8u)

/** \\brief  989C, TOM Channel Interrupt Notification Register */
#define GTM_TOM3_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010989Cu)

/** \\brief  9884, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM3_CH2_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109884u)

/** \\brief  9888, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM3_CH2_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109888u)

/** \\brief  9898, TOM Channel Status Register */
#define GTM_TOM3_CH2_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109898u)

/** \\brief  98CC, TOM Channel CCU0 Compare Register */
#define GTM_TOM3_CH3_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF01098CCu)

/** \\brief  98D0, TOM Channel CCU1 Compare Register */
#define GTM_TOM3_CH3_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF01098D0u)

/** \\brief  98D4, TOM Channel CCU0 Counter Register */
#define GTM_TOM3_CH3_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF01098D4u)

/** \\brief  98C0, TOM Channel Control Register’ */
#define GTM_TOM3_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF01098C0u)

/** \\brief  98E0, TOM Channel Interrupt Enable Register */
#define GTM_TOM3_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01098E0u)

/** \\brief  98E4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM3_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01098E4u)

/** \\brief  98E8, TOM IRQ Mode Configuration Register */
#define GTM_TOM3_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01098E8u)

/** \\brief  98DC, TOM Channel Interrupt Notification Register */
#define GTM_TOM3_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF01098DCu)

/** \\brief  98C4, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM3_CH3_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF01098C4u)

/** \\brief  98C8, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM3_CH3_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF01098C8u)

/** \\brief  98D8, TOM Channel Status Register */
#define GTM_TOM3_CH3_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF01098D8u)

/** \\brief  990C, TOM Channel CCU0 Compare Register */
#define GTM_TOM3_CH4_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010990Cu)

/** \\brief  9910, TOM Channel CCU1 Compare Register */
#define GTM_TOM3_CH4_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109910u)

/** \\brief  9914, TOM Channel CCU0 Counter Register */
#define GTM_TOM3_CH4_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109914u)

/** \\brief  9900, TOM Channel Control Register’ */
#define GTM_TOM3_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109900u)

/** \\brief  9920, TOM Channel Interrupt Enable Register */
#define GTM_TOM3_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109920u)

/** \\brief  9924, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM3_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109924u)

/** \\brief  9928, TOM IRQ Mode Configuration Register */
#define GTM_TOM3_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109928u)

