HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  A028, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH0_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A028u)

/** \\brief  A01C, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH0_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A01Cu)

/** \\brief  A004, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH0_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A004u)

/** \\brief  A008, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH0_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A008u)

/** \\brief  A018, TOM Channel Status Register */
#define GTM_TOM4_CH0_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A018u)

/** \\brief  A28C, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH10_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A28Cu)

/** \\brief  A290, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH10_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A290u)

/** \\brief  A294, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH10_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A294u)

/** \\brief  A280, TOM Channel Control Register’ */
#define GTM_TOM4_CH10_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A280u)

/** \\brief  A2A0, TOM Channel Interrupt Enable Register */
#define GTM_TOM4_CH10_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A2A0u)

/** \\brief  A2A4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM4_CH10_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A2A4u)

/** \\brief  A2A8, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH10_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A2A8u)

/** \\brief  A29C, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH10_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A29Cu)

/** \\brief  A284, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH10_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A284u)

/** \\brief  A288, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH10_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A288u)

/** \\brief  A298, TOM Channel Status Register */
#define GTM_TOM4_CH10_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A298u)

/** \\brief  A2CC, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH11_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A2CCu)

/** \\brief  A2D0, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH11_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A2D0u)

/** \\brief  A2D4, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH11_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A2D4u)

/** \\brief  A2C0, TOM Channel Control Register’ */
#define GTM_TOM4_CH11_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A2C0u)

/** \\brief  A2E0, TOM Channel Interrupt Enable Register */
#define GTM_TOM4_CH11_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A2E0u)

/** \\brief  A2E4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM4_CH11_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A2E4u)

/** \\brief  A2E8, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH11_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A2E8u)

/** \\brief  A2DC, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH11_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A2DCu)

/** \\brief  A2C4, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH11_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A2C4u)

/** \\brief  A2C8, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH11_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A2C8u)

/** \\brief  A2D8, TOM Channel Status Register */
#define GTM_TOM4_CH11_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A2D8u)

/** \\brief  A30C, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH12_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A30Cu)

/** \\brief  A310, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH12_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A310u)

/** \\brief  A314, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH12_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A314u)

/** \\brief  A300, TOM Channel Control Register’ */
#define GTM_TOM4_CH12_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A300u)

/** \\brief  A320, TOM Channel Interrupt Enable Register */
#define GTM_TOM4_CH12_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A320u)

/** \\brief  A324, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM4_CH12_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A324u)

/** \\brief  A328, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH12_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A328u)

/** \\brief  A31C, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH12_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A31Cu)

/** \\brief  A304, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH12_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A304u)

/** \\brief  A308, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH12_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A308u)

/** \\brief  A318, TOM Channel Status Register */
#define GTM_TOM4_CH12_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A318u)

/** \\brief  A34C, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH13_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A34Cu)

/** \\brief  A350, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH13_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A350u)

/** \\brief  A354, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH13_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A354u)

/** \\brief  A340, TOM Channel Control Register’ */
#define GTM_TOM4_CH13_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A340u)

/** \\brief  A360, TOM Channel Interrupt Enable Register */
#define GTM_TOM4_CH13_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A360u)

/** \\brief  A364, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM4_CH13_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A364u)

/** \\brief  A368, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH13_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A368u)

