HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxGtm_reg.h
/** \\brief  A1CC, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH7_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A1CCu)

/** \\brief  A1D0, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH7_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A1D0u)

/** \\brief  A1D4, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH7_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A1D4u)

/** \\brief  A1C0, TOM Channel Control Register’ */
#define GTM_TOM4_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A1C0u)

/** \\brief  A1E0, TOM Channel Interrupt Enable Register */
#define GTM_TOM4_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A1E0u)

/** \\brief  A1E4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM4_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A1E4u)

/** \\brief  A1E8, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A1E8u)

/** \\brief  A1DC, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A1DCu)

/** \\brief  A1C4, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH7_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A1C4u)

/** \\brief  A1C8, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH7_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A1C8u)

/** \\brief  A1D8, TOM Channel Status Register */
#define GTM_TOM4_CH7_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A1D8u)

/** \\brief  A20C, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH8_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A20Cu)

/** \\brief  A210, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH8_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A210u)

/** \\brief  A214, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH8_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A214u)

/** \\brief  A200, TOM Channel Control Register’ */
#define GTM_TOM4_CH8_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A200u)

/** \\brief  A220, TOM Channel Interrupt Enable Register */
#define GTM_TOM4_CH8_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A220u)

/** \\brief  A224, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM4_CH8_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A224u)

/** \\brief  A228, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH8_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A228u)

/** \\brief  A21C, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH8_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A21Cu)

/** \\brief  A204, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH8_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A204u)

/** \\brief  A208, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH8_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A208u)

/** \\brief  A218, TOM Channel Status Register */
#define GTM_TOM4_CH8_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A218u)

/** \\brief  A24C, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH9_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A24Cu)

/** \\brief  A250, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH9_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A250u)

/** \\brief  A254, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH9_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A254u)

/** \\brief  A240, TOM Channel Control Register’ */
#define GTM_TOM4_CH9_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A240u)

/** \\brief  A260, TOM Channel Interrupt Enable Register */
#define GTM_TOM4_CH9_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A260u)

/** \\brief  A264, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM4_CH9_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A264u)

/** \\brief  A268, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH9_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A268u)

/** \\brief  A25C, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH9_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A25Cu)

/** \\brief  A244, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH9_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A244u)

/** \\brief  A248, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH9_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A248u)

/** \\brief  A258, TOM Channel Status Register */
#define GTM_TOM4_CH9_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A258u)

/** \\brief  A034, TOM TGC0 Action Time Base Register */
#define GTM_TOM4_TGC0_ACT_TB /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ACT_TB*)0xF010A034u)

/** \\brief  A070, TOM TGC0 Enable/Disable Control Register */
#define GTM_TOM4_TGC0_ENDIS_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ENDIS_CTRL*)0xF010A070u)

/** \\brief  A074, TOM TGC0 Enable/Disable Status Register */
#define GTM_TOM4_TGC0_ENDIS_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ENDIS_STAT*)0xF010A074u)

/** \\brief  A038, TOM TGC0 Force Update Control Register */
#define GTM_TOM4_TGC0_FUPD_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_FUPD_CTRL*)0xF010A038u)

/** \\brief  A030, TOM TGC0 Global Control Register */
#define GTM_TOM4_TGC0_GLB_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_GLB_CTRL*)0xF010A030u)

/** \\brief  A03C, TOM TGC0 Internal Trigger Control Register */
#define GTM_TOM4_TGC0_INT_TRIG /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_INT_TRIG*)0xF010A03Cu)

/** \\brief  A078, TOM TGC0 Output Enable Control Register */
#define GTM_TOM4_TGC0_OUTEN_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_OUTEN_CTRL*)0xF010A078u)

/** \\brief  A07C, TOM TGC0 Output Enable Status Register */
#define GTM_TOM4_TGC0_OUTEN_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_OUTEN_STAT*)0xF010A07Cu)

